package Game.miniproject_mom;

import java.util.ArrayList;
import java.util.Scanner;

import Game.Dain.CinemaAscii;
import javazoom.jl.player.MP3Player;


public class MomMain {

	public static void main(String[] args) {
		
		Scanner sc = new Scanner(System.in);
		String comPath = "data\\song\\Mom\\";
		MP3Player mp3 = new MP3Player();
		
		int pickWeapon = 0;
		int pickClass = 0;
		people p = new people(); 
		people Drakaina = new people("Drakaina", 3500, "fireRage", "thunderLightening");
		people Druid = new people("Druid", 2500, "야생의영혼");
		people Warlock = new people("Warlock", 2500, "거부할수없는유혹");
		people Paladin = new people("Paladin", 2500, "빛의심판");
		people Human = new people("Human", 1500, "용감무쌍");

		String gtitle = 
				
				  "		        ███████╗██╗███╗   ███╗██████╗ ██╗   ██╗██████╗ ███╗   ███╗           \r\n"
				+ "		        ██╔════╝██║████╗ ████║██╔══██╗██║   ██║██╔══██╗████╗ ████║           \r\n"
				+ "		        ███████╗██║██╔████╔██║██████╔╝██║   ██║██████╔╝██╔████╔██║           \r\n"
				+ "		        ╚════██║██║██║╚██╔╝██║██╔══██╗██║   ██║██╔══██╗██║╚██╔╝██║           \r\n"
				+ "		        ███████║██║██║ ╚═╝ ██║██████╔╝╚██████╔╝██║  ██║██║ ╚═╝ ██║           \r\n"
				+ "		        ╚══════╝╚═╝╚═╝     ╚═╝╚═════╝  ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝           \r\n"
				+ "		                                                                             \r\n"
				+ "		 █████╗ ██████╗ ██╗   ██╗███████╗███╗   ██╗████████╗██╗   ██╗██████╗ ███████╗\r\n"
				+ "		██╔══██╗██╔══██╗██║   ██║██╔════╝████╗  ██║╚══██╔══╝██║   ██║██╔══██╗██╔════╝\r\n"
				+ "		███████║██║  ██║██║   ██║█████╗  ██╔██╗ ██║   ██║   ██║   ██║██████╔╝█████╗  \r\n"
				+ "		██╔══██║██║  ██║╚██╗ ██╔╝██╔══╝  ██║╚██╗██║   ██║   ██║   ██║██╔══██╗██╔══╝  \r\n"
				+ "		██║  ██║██████╔╝ ╚████╔╝ ███████╗██║ ╚████║   ██║   ╚██████╔╝██║  ██║███████╗\r\n"
				+ "		╚═╝  ╚═╝╚═════╝   ╚═══╝  ╚══════╝╚═╝  ╚═══╝   ╚═╝    ╚═════╝ ╚═╝  ╚═╝╚══════╝\r\n"
				+ "                                                                             ";
		try {
		
		System.out.printf("\n\n");
		System.out.print(
				" 		==============================================================================\r\n");
		Thread.sleep(200);
		System.out.printf("\n\n\n\n"); // 슈카월드 배경음악 뜨뜨른뜨르~!
		System.out.println(gtitle);
		System.out.printf("\n\n");
		Thread.sleep(200);
		System.out.print(
				" 		==============================================================================\r\n");
		Thread.sleep(200);
		System.out.print("		                         	★ 심 부 름 어 드 벤 처 ★                             \r\n");
		Thread.sleep(200);
		
		System.out.print("		                        	    LOADING....                             \r\n"); // 10

		String line = "		■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■	\r\n";
		int timeLap = 200; // 시간 간격 (200밀리초)

		for (int i = 0; i < line.length(); i++) {
			System.out.print(line.charAt(i));
			try {
				Thread.sleep(10);
			} catch (InterruptedException e) {
				e.printStackTrace();
			}
		}
		System.out.println("		                                    로딩 완료!!                                          ");
		System.out.println();
		System.out.println();		
		Thread.sleep(200);
		
		
		// 회원가입
		// 로그인
		
		// 게임 시작
		System.out.println("		게임을 시작하시겠습니까?");
		System.out.println("		[1] 네				[2] 아니오");
		int gameStart= sc.nextInt();
		if(gameStart==1) {
			
		}
		
		
		////////////////////////////////////////// 1. chapter 엄마와의 대화
		
		String home = 
				  "			                   )\r\n"
				+ "			                 _(\r\n"
				+ "			             ___|_|_________\r\n"
				+ "			            /___|_|_________\\\r\n"
				+ "			       ()  /_________________\\\r\n"
				+ "			   `'.()))/___________________\\'-.'`'.\r\n"
				+ "			  .,'(())()   ____     ____  |,.'     '-.\r\n"
				+ "			     )(()))  |)~~(|   |)~~(| |. '-. ()`'.\r\n"
				+ "			    ()()(()) ||__||   ||__|| | `'.,(())\r\n"
				+ "			   ())()(()))________________|___ ()))()\r\n"
				+ "			   ()((())()))| | | | | | | | | | (()()))\r\n"
				+ "			  ()))(()()())|_|_|_|_|_|_|_|_|_|)(()(()\r\n"
				+ "			  (()((())(()-------------------|(())(())\r\n"
				+ "			  ~^~ ^\" ^\"  ^~^   ^\"   ~^~    ^~^~(()(()\r\n"
				+ "			  ^\"     ^~^   ~^~   ^\"    ^~^   ~~^~\"\"^\r\n";
				
		System.out.println("\n\n\n\n");
		System.out.println(home);
		System.out.println("\n\n\n\n");
		Thread.sleep(200);
		System.out.println("			평화로운 일요일 오후"); 
		Thread.sleep(200);
		System.out.println("			[나] 오늘은 비도 온다는데 집에서 겜이나 한판 해야 겠다"); // 괄호 안에 ""넣는법
		System.out.println();
		Thread.sleep(200);
		System.out.println("			넘어가기 [0] ");
		int c1e1 = sc.nextInt();
		if(c1e1==0) {	
		}

		String mother = 
				  "				⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣶⡟⠻⢿⣶⣤⣄⡀⠀⠀\r\n"
				+ "				⠀⠀⠀⠀⠀⠀⠀⠀⣠⡾⣋⡍⣰⠀⣶⣮⠏⣿⣿⣷⣄⠀\r\n"
				+ "				⠀⠀⠀⠀⠀⠀⢀⣼⣿⣼⣿⡟⠟⠓⠉⠛⠂⢿⣿⣾⣿⣧\r\n"
				+ "				⠀⠀⠀⠀⠀⢀⣾⡿⣻⣿⡿⠛⠀⠀⢀⠀⠀⠀⠛⣿⣿⡟\r\n"
				+ "				⠀⠀⠀⠀⠀⣼⣿⡇⡎⠉⠀⠀⢲⣶⡄⠃⠀⠀⠀⠟⠁⠀\r\n"
				+ "				⠀⢀⣠⡀⣸⢱⣿⡷⡄⠀⠀⠀⠀⠁⠁⠀⣴⢎⠝⠀⠀⠀\r\n"
				+ "				⢰⣯⣤⣌⡃⣾⣿⡇⠇⠀⠀⠀⠀⠀⠀⣘⠉⡎⠁⠀⠀⠀\r\n"
				+ "				⢸⣿⣇⣿⣧⣿⡟⠀⠈⠄⠀⠀⠨⢵⠎⢀⣴⡇⠀⠀⠀⠀\r\n"
				+ "				⠸⣿⣿⣾⣿⠯⡀⠀⠀⠈⠃⠢⣀⣠⢲⠉⠋⣣⡀⠀⠀⠀\r\n"
				+ "				⠀⢀⠽⠿⣤⡢⡀⠑⢄⠀⠀⢱⢌⠙⠈⠀⠀⠘⢽⡆⠀⠀\r\n"
				+ "				⢰⠉⣿⠸⣷⠪⡢⡔⢄⠑⢄⠆⣀⠱⢄⠀⠀⠀⠀⠱⠀⠀\r\n"
				+ "				⢸⣆⢻⣆⠹⣧⠸⣮⡣⡕⠄⡀⣀⠀⠄⣊⣦⡀⠀⠀⠀⠀\r\n"
				+ "				⠈⢿⡄⢻⣆⠹⣷⡙⣧⠙⣦⡞⢶⡔⣿⡙⣧⣇⢤⠀⡇⠀\r\n"
				+ "				⠀⢎⢿⡄⢻⣦⠘⢿⡜⢷⡈⠿⠜⣷⢸⣧⠙⠀⠀⠀⢇⠀\r\n"
				+ "				⠀⠈⠈⠉⠀⠉⠁⠈⠛⠈⠛⠂⠀⠀⠀⠉⢰⠀⠀⠀⠉⠀";
		
		
		System.out.println("\n\n\n\n");
		System.out.println(mother);
		System.out.println("\n\n\n\n");
		System.out.println("			[엄마] 영웅아, 일어나! 마트 가서 두 부 한 모 좀 사다 주렴. ");
		Thread.sleep(200);
		System.out.println("			[1]  (아.. 귀찮은데) 못들은 체 한다.          [2] 네 알겠어요 엄마!    ");
		
		int c1e2 = sc.nextInt();
		if(c1e2==1) {
			System.out.println("			(경고) 용돈이 깎였습니다.");
			Thread.sleep(200);
			System.out.println("			[엄마] 김영웅! 오늘 저녁은 없을 줄 알아!! 빨리 갔다 와");
			Thread.sleep(200);
			System.out.println("			[영웅이] (궁시렁 궁시렁) 다음부터는 쿠팡에서 미리 시키세용... ");
			
			System.out.println();
			Thread.sleep(200);
			System.out.println("			넘어가기 [0] ");
			int c1e3 = sc.nextInt();
			if(c1e3==0) {
			}
			

		}  else if(c1e2==2) {
		}
		
		// 나갈 준비
		Thread.sleep(1000);
		System.out.println("			(주섬 주섬) 나갈 준비를 한다. 뭘 가지고 갈까? ");
		System.out.println("			[1] 우산 [2] 건틀렛 [3] ? [4] 해골검" );
		
		int c1e4 = sc.nextInt();
		if(c1e4==1) {
			 pickWeapon=1;
			 String umbrella = 
					  "			░░░░░░░░░░░░░░░░░░▄▄░░░░░░░░░░░░░░░░░░\r\n"
			 		+ "			░░░░░░░░░░░░░░░▄▄███▀█▄░░░░░░░░░░░░░░░\r\n"
			 		+ "			░░░░░░░░░▄▄▄████████░░░▀▀▄▄▄░░░░░░░░░░\r\n"
			 		+ "			░░░░░███████████████░░░░░░░▀▀▀▀██░░░░░\r\n"
			 		+ "			░░░░░█░▀████████████░░░░░░░░░▄███▄░░░░\r\n"
			 		+ "			░░░░█▀░░░▀██████████░░░░░░░▄██████░░░░\r\n"
			 		+ "			░░░▄█░░░░░░▀████████░░░░░▄████████▄░░░\r\n"
			 		+ "			░░▄█░░░░░░░░░▀██████░░░▄███████████░░░\r\n"
			 		+ "			░▄█░░░░░░░░░░░░▀████░▄██████████████▄░\r\n"
			 		+ "			▄█░░░░░░░░░░░░░░░█████████████████████\r\n"
			 		+ "			▀████████████████████▀▀▀▀▀▀▀▀▀▀▀░░░░█▀\r\n"
			 		+ "			░▀███████████████▀████▄░░░░░░░░░░░░█░░\r\n"
			 		+ "			░░▀████████████▀░░██████▄░░░░░░░░░█░░░\r\n"
			 		+ "			░░░▀█████████▀░░░░████████▄░░░░░░█░░░░\r\n"
			 		+ "			░░░░███████▀░░░░░░░█████████▄▄░░░█░░░░\r\n"
			 		+ "			░░░░░████▀░░░░░░░░░████████████▄█▀░░░░\r\n"
			 		+ "			░░░░░███░░░░░░░░░░░██████████████░░░░░\r\n"
			 		+ "			░░░░░░▀▀▀▀▀▀█▄▄░░░░███████▀▀▀░░░░░░░░░\r\n"
			 		+ "			░░░░░░░░░░░░░░░▀▀▄▄███▀▀░░░░░░░░░░░░░░\r\n";
					 
		System.out.println("\n\n");
		System.out.println(umbrella);
		System.out.println("\n\n");
		System.out.println();
		System.out.println("			[비닐우산]을 챙겼다. "); // 비오면 
		} else if(c1e4==2) {
		pickWeapon=2;	
		String gauntlet = 
				  "			⣿⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⣿⡿⠁⢠⣌⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⡿⠁⢀⣾⠋⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⠁⠀⣼⠃⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⡏⢀⣾⠃⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⡇⠘⣷⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⡀⠘⣷⡀⠀⠀⠀⢀⣠⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⣷⣄⣈⣿⣦⡶⠾⠛⠁⠀⠀⠉⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⢀⣤⠶⠟⠛⢿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⣿⣿⣿⠈⠛⢷⣄⡀⠀⠀⣠⡶⠛⠋⣀⣤⡶⣾⡛⠻⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠉⠻⣶⣴⣟⣀⣴⡾⠛⢿⣄⠈⢿⣄⣸⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⠾⠛⠛⠛⢿⣿⣿⣆⣀⣠⣿⡶⠾⢿⡍⠘⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣀⠀⢀⣤⡿⣿⣿⣿⠉⠈⢿⣄⣨⣿⡾⢿⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟⡁⠀⣸⣿⣿⣿⠛⠋⢿⣅⣼⣷⣾⣿⣿⣿\r\n"
				+ "			⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣾⣿⣿⣿⣿⣿⣿⣿";
		
		System.out.println("\n\n");
		System.out.println(gauntlet);
		System.out.println("\n\n");
		System.out.println();
		System.out.println("			[건틀렛]을 챙겼다."); // 깡패 만나면 크리티컬
		} else if(c1e4==3) {
		pickWeapon=3;
		System.out.println("			[?]를 골랐다. 뭐가 나올까....");
		Thread.sleep(500);
		System.out.println("			두구두구 두구두구... ");
		Thread.sleep(500);
		String lightsaver =
				  "		 __-----_________________{]__________________________________________________\r\n"
				+ "		{&&&&&&&#%%&#%&%&%&%&%#%&|]__________________________________________________\\\r\n"
				+ "		                         {]";
		
		System.out.println("\n\n");
		System.out.println(lightsaver);
		System.out.println("\n\n");
		System.out.println();
		System.out.println("			[광선검]이 나왔다! ");
		System.out.println("			[광선검]을 챙겼다. "); // 드래곤 마주치면 크리티컬
		} else if(c1e4==4) {
		pickWeapon=4;
		String sword = 
				  "		                              .___.\r\n"
				+ "		          /)               ,-^     ^-.\r\n"
				+ "		         //               /           \\\r\n"
				+ "		.-------| |--------------/  __     __  \\-------------------.__\r\n"
				+ "		|WMWMWMW| |>>>>>>>>>>>>> | />>\\   />>\\ |>>>>>>>>>>>>>>>>>>>>>>:>\r\n"
				+ "		`-------| |--------------| \\__/   \\__/ |-------------------'^^\r\n"
				+ "		         \\\\               \\    /|\\    /\r\n"
				+ "		          \\)               \\   \\_/   /\r\n"
				+ "		                            |       |\r\n"
				+ "		                            |+H+H+H+|\r\n"
				+ "		                            \\       /\r\n"
				+ "		                             ^-----^\r\n";
		System.out.println("\n\n");
		System.out.println(sword);
		System.out.println("\n\n");
		System.out.println();
		System.out.println("			[해골검]을 챙겼다. "); // 드래곤 마주치면 크리티컬
			
		}
		
		Thread.sleep(200);
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c1e5 = sc.nextInt();
		if(c1e5==0) {
		}
		// 노래 선택
		
		String headphone = 
				  "			───────────────── \r\n"
				+ "			░░░░░▄▄▄▄░░░░░░░░░░░░░ \r\n"
				+ "			░░▟▀▀░░▓▓▓▓▓▓▓▓▓▓▓▀▀▄░░░ \r\n"
				+ "			░▐░░░▓▓▓▓▓▓▓▓▓▓▓▓▓▓░░▐░░ \r\n"
				+ "			░▐░░▓▓▓▓▓▓▓▓░░░░░▓▓░░▐░░ \r\n"
				+ "			░▐░▓▓▓▓▓░░░░░░░░░░▓█░█░░ \r\n"
				+ "			░▐░█▓░░░░░░░░░░░░░▓███░░ \r\n"
				+ "			░▐██▓░░▄▄▄░░░▀▀▀░░▓███░░ \r\n"
				+ "			░▐██▓░░     █  ░░░▓███░░ \r\n"
				+ "			░▐██▓░░░░░░░░░░░░░▓████░ \r\n"
				+ "			░░██▓░░░░░░▐░░░░░░▓██░█░ \r\n"
				+ "			░░██▓░░░░░░▐░░░░░░▓█░░█░ \r\n"
				+ "			░░░░▓░░░░░▗▟░░░░░░▓░░█░░ \r\n"
				+ "			░░░░▓░░░░░░░░░░░░░▓░░█░░ \r\n"
				+ "			░░░░░▓░░░▀▀▀▀▀░░░▓░░░░░░ \r\n"
				+ "			░░░░░░▓░░░░░░░░░▓░░░░░░░ \r\n"
				+ "			░░░░░░░▓░░░░░░░▓░░░░░░░░ \r\n"
				+ "			░░░░░░░░▓▓▓▓▓▓▓░░░░░░░░░ \r\n";
		
		System.out.println("\n\n");
		System.out.println(headphone);
		System.out.println("\n\n");
		Thread.sleep(200);
		System.out.println("			헤드폰을 착용한다. 무슨 노래를 들을까? ");
		System.out.println("			[1] 헤비메탈     [2] 케이팝     [3] 아이유     [4] 힙합 ");
		int c1e6 = sc.nextInt();
		if(c1e6==1) {
				//play. 헤비메탈 : Blihne Channel - Over My Deadbody 12초부터 재생
		System.out.println("			♩	♪	♬ 둠 칫 둠 칫 ~ ♩	♪	♬ ");
		System.out.println("			음악은 역시 헤비메탈이지~ 기운 솟아난다!! ");
		} else if(c1e6==2) {
				//play. 케이팝 : 오마이걸 - Dun Dun Dance 시작부분부터 재생
		System.out.println("			♩	♪	♬ 둠 칫 둠 칫 ~ ♩	♪	♬ ");
		System.out.println("			국뽕 케이팝이 최고야~ 너무 좋아서 춤이 절로 나오네");
		} else if(c1e6==3) {
				//play. 아이유 : 아이유 - 라일락 후렴구부터 재생
		System.out.println("			♩	♪	♬ 둠 칫 둠 칫 ~ ♩	♪	♬ ");
		System.out.println("			역시 음악은 아이유지~ 킹정~?");
		} else if(c1e6==4) {
				//play. 힙합 : 창모 - 메테오 시작부분부터 재생
		System.out.println("			♩	♪	♬ 둠 칫 둠 칫 ~ ♩	♪	♬ ");
		System.out.println("			역시 국힙원탑.. 요즘 활동 안하남...  ");
		} else {
			
		}
		
		Thread.sleep(200);
		System.out.println();
		System.out.println("			[영웅이] 엄마!! 다녀오겠습니다~ ");
		
		Thread.sleep(200);
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c1e7 = sc.nextInt();
		if(c1e7==0) {
		}
		
		// 도로 아스키아트 
		String leavinghome = 
				  "			                                                           |>>>\r\n"
				+ "			                   _                      _                |\r\n"
				+ "			    ____________ .' '.    _____/----/-\\ .' './========\\   / \\\r\n"
				+ "			   //// ////// /V_.-._\\  |.-.-.|===| _ |-----| u    u |  /___\\\r\n"
				+ "			  // /// // ///==\\ u |.  || | ||===||||| |T| |   ||   | .| u |_ _ _ _ _ _\r\n"
				+ "			 ///////-\\////====\\==|:::::::::::::::::::::::::::::::::::|u u| U U U U U\r\n"
				+ "			 |----/\\u |--|++++|..|'''''''''''::::::::::::::''''''''''|+++|+-+-+-+-+-+\r\n"
				+ "			 |u u|u | |u ||||||..|              '::::::::'           |===|>=== _ _ ==\r\n"
				+ "			 |===|  |u|==|++++|==|              .::::::::.           | T |....| V |..\r\n"
				+ "			 |u u|u | |u ||HH||         \\|/    .::::::::::.\r\n"
				+ "			 |===|_.|u|_.|+HH+|_              .::::::::::::.              _\r\n"
				+ "			                __(_)___         .::::::::::::::.         ___(_)__\r\n"
				+ "			---------------/  / \\  /|       .:::::;;;:::;;:::.       |\\  / \\  \\-------\r\n"
				+ "			______________/_______/ |      .::::::;;:::::;;:::.      | \\_______\\________\r\n"
				+ "			|       |     [===  =] /|     .:::::;;;::::::;;;:::.     |\\ [==  = ]   |\r\n"
				+ "			|_______|_____[ = == ]/ |    .:::::;;;:::::::;;;::::.    | \\[ ===  ]___|____\r\n"
				+ "			     |       |[  === ] /|   .:::::;;;::::::::;;;:::::.   |\\ [=  ===] |\r\n"
				+ "			_____|_______|[== = =]/ |  .:::::;;;::::::::::;;;:::::.  | \\[ ==  =]_|______\r\n"
				+ "			 |       |    [ == = ] /| .::::::;;:::::::::::;;;::::::. |\\ [== == ]      |\r\n"
				+ "			_|_______|____[=  == ]/ |.::::::;;:::::::::::::;;;::::::.| \\[  === ]______|_\r\n"
				+ "			   |       |  [ === =] /.::::::;;::::::::::::::;;;:::::::.\\ [===  =]   |\r\n"
				+ "			___|_______|__[ == ==]/.::::::;;;:::::::::::::::;;;:::::::.\\[=  == ]___|_____\r\n";
		System.out.println("\n\n");
		System.out.println(leavinghome);
		System.out.println("\n\n");
		Thread.sleep(200);
		System.out.println("			집을 나선다! 마트로 출발~! ");
		
		Thread.sleep(200);
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c1e8 = sc.nextInt();
		if(c1e8==0) {
		}
		
		///////////////////////////////////// chapter.2 언덕 지나는데 할머니 만남
		
		String wagongrandma = 
				  "                   .---.		\r\n"
				+ "                  (_---_)		\r\n"
				+ "                 (_/6 6\\_)		\r\n"
				+ "                  (  v  )		\r\n"
				+ "                   `\\ /'		⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣤⣤⡀⠀⠀⠀\r\n"
				+ "                .-'': ;``-.		⠀⠀⠀⢀⣤⠀⢤⣀⣀⣀⣀⣴⠀⣶⣦⣤⣤⣤⣶⠀⣾⣿⣿⣿⣿⡿⠁⠀⠀⠀\r\n"
				+ "               /   \\,Y./   \\	⠀⠘⣿⣿⣿⡇⢸⣿⣿⣿⣿⣿⠀⣿⣿⣿⣿⣿⡇⢰⣿⣿⣿⣿⡿⠁⠀⠀⠀⠀\r\n"
				+ "              /     (:)___  \\	⠀⠀⢹⣿⣿⣷⠀⣿⣿⣿⣿⣿⠀⣿⣿⣿⣿⣿⡇⣼⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀\r\n"
				+ "             :   .-'XXX`-.`\\_;	⠀⠀⠀⣿⣿⣿⠀⢿⣿⣿⣿⣿⠀⣿⣿⣿⣿⣿⠃⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀\r\n"
				+ "              `.__.-XXX-.__.'\\_ ⠀⠀⠀⣿⣿⣿⡄⢸⣿⣿⣿⣿⠀⣿⣿⣿⣿⣿⠀⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⠀\r\n"
				+ "               /  / XXX \\  \\   ⠀⠀⠀⣿⣿⣿⡇⢸⣿⣿⣿⣿⠀⣿⣿⣿⣿⣿⠀⣿⣿⣿⣿⠀⣶⠀⠀⠀⠀⠀\r\n"
				+ "              /      XXX    \\   ⠀⠀⠘⠛⠛⠛⠃⠘⠛⠛⠛⠛⠀⠛⠛⠛⠛⠛⠀⠛⠛⠛⠛⠀⠛⠛⢿⠀⠀\r\n"
				+ "             /        XXX    \\  ⠀⠀⣿⠏⡀⠲⡇⢸⠖⢀⠙⣿⣿⣿⡟⢁⠐⢾⠀⠗⢀⠙⢿⣿⣿⣧⣤⣤⡄\r\n"
				+ "            /                 \\ ⠀⠀⠋⠀⠛⠂⠀⠀⠐⠛⠀⠘⠛⠛⠀⠚⠓⠀⠀⠀⠛⠃⠘⠛⠛⠁⠀⠀⠀⠀\r\n"
				+ "           /                   \\⠀⠀⠀⠀⠛⢁⡄⢰⣌⠛⠀⠀⠀⠀⠀⠙⢁⣤⠀⣄⠙⠁⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "           `--...___   ___...--' ⠀⠀⠀⠀⠀⠀⠁⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ \r\n";
		
		System.out.println("\n\n");
		System.out.println(wagongrandma);
		System.out.println("\n\n");
		Thread.sleep(200);
		System.out.println("			힘들게 리어카를 끌고 있는 할머니가 보인다!");
		Thread.sleep(2000);
		System.out.println("			[할머니] 학생... 나 좀 도와 줘. ");
		Thread.sleep(2000);
		System.out.println("			[1] 못본 척 한다.		[2] 도와 드린다. "); 
		int c2e1 = sc.nextInt();
		if(c2e1==1) {
		System.out.println("			쯧쯧... 고얀놈... 요즘 것들은....");
		} else if(c2e1==2) {
		System.out.println("			[미니게임1] 할머니 도와드리기 - 10초에 가깝게 엔터치기! ");	
		
		// 할머니를 도와드리기로 하면 미니게임1. 10초 안에 엔터치기 게임
		// 🕶 게임방법
		// 할머니의 닉네임을 받는다.
		// 준비가되면 Enter를 누르라는 내용을 콘솔에 띄운다.
		// 10초가 지나면 Enter를 누른다.
		// Double 타입으로 초를 추출해낸다.
		// 두번째 사람도 똑같이 1~4번을 반복한다.
		// 할머니와 나의 기록을 절대값으로 비교하여 10에 가까운 사람을 추출해 낸다.
		// 내가 10에 가까우면 할머니 도와드리기 성공!
		// 할머니가 10에 더 가까우면 도와드리기 실패!
		
		long a = 0;
		long b = 0;
		double result1 = 0;
		System.out.print("			할머니가 먼저 시작합니다. 할머니 라고 입력하세요. >>> ");
		String user1 = sc.next();
		
		System.out.println("			"+user1 + "님 시작하려면 <Enter>를 누르세요.");
		sc.nextLine();
		sc.nextLine();
		a = System.currentTimeMillis();
		
		System.out.println("			10초가 된 것 같으면 <Enter>를 누르세요.");
		sc.nextLine();
		b = System.currentTimeMillis();
		
		result1 = (double) ((b - a) * 0.001);
		
		System.out.println("			종료시간 : " + result1 + "초");
		
		long c = 0;
		long d = 0;
		double result2 = 0;
		
		System.out.print("			내 차례입니다. 내 이름을 입력하세요! >>> ");
		String user2 = sc.next();
		
		System.out.println("			"+user2 + "님 시작하려면 <Enter>를 누르세요.");
		sc.nextLine();
		sc.nextLine();
		c = System.currentTimeMillis();
		
		System.out.println("			10초가 된 것 같으면 <Enter>를 누르세요.");
		sc.nextLine();
		d = System.currentTimeMillis();
		
		result2 = (double) ((d - c) * 0.001);
		
		System.out.println("			종료시간 : " + result2 + "초");
		
		if(Math.abs(result1 - 10) < Math.abs(result2 - 10)) {
		System.out.println("			"+user1 + "			님이" + Math.abs(result1-result2) + "차이로 승리하셨습니다!!");
		System.out.println("			할머니 도와드리기 실패!");
		System.out.println("			[할머니] 젊은 사람이 이렇게 힘이 없어서야... 약골이구만... ");
		} else {
		System.out.println("			"+user2 + "			님이" + Math.abs(result2-result1) + "차이로 승리하셨습니다!!");
		System.out.println("			[할머니] 학생 고맙네... ");
		}	
		}
		Thread.sleep(200);
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c2e2 = sc.nextInt();
		if(c2e2==0) {
		}
		///////////////////////////////////// chapter.3 주택가 지나는데 도둑 만남.
		
		String thief = 
				  "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⢀⣴⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠀⠀⠀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠉⠛⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⣷⡄⠀⣀⣀⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⣠⣶⣦⣈⠻⣦⠈⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⢻⣿⣿⣿⣿⣿⣿⡿⠁⣼⡿⠻⣿⣿⣷⣄⣠⣴⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠻⣿⣿⣿⣿⡟⠀⢸⣿⣿⣦⣄⡉⠛⠛⠛⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠈⠛⠿⠋⠀⠀⢻⣿⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⣀⣀⣤⣶⣄⠀⠀⠈⠿⢿⣿⣿⣿⣿⣿⣶⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠸⠟⠛⠉⠻⣿⣧⡀⣼⣶⣤⣄⠉⠉⠛⠛⠻⢿⣿⣦⡀⠀⠀⠀⣠⡀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⡿⠋⠁⠀⠀⠀⠀⠀⠀⠙⢿⣿⣆⣠⣾⠟⠁⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣿⡿⠁⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\\r\\n";
		
		// 미니게임2. 블랙잭 게임
		System.out.println("\n\n");
		System.out.println(thief);
		System.out.println("\n\n");
		Thread.sleep(200);
		System.out.println("			앗, 도둑이 출몰했다.! ");
		Thread.sleep(200);
		System.out.println("			[도둑] 홍홍홍 나 잡아봐랑~ 뿌잉뿌잉 ");
		Thread.sleep(200);
		System.out.println();
		System.out.println("			[영웅이] 아.... 말투 진짜 킹받네.... 내가 꼭 잡아 주마!");
		Thread.sleep(200);
		System.out.println("			[미니게임2] 도둑잡기 챌린지 - 행운의 블랙잭!");
		
		// 블랙잭 3판 2승하면 이김
		// 이겼으면 [경찰] "아니 이걸 해내다니..... ?" 
		// 졌으면 [경찰] "오늘도 허탕이군.. "
		
		Thread.sleep(200);
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int nextc3c1 = sc.nextInt();
		if(nextc3c1==0) {
		}
		
		
		///////////////////////////////////// chapter.4 아름다운 강변에서
		
		String firework= 
				  "		                                       .\r\n"
				+ "		              . .                     -:-             .  .  .\r\n"
				+ "		            .'.:,'.        .  .  .     ' .           . \\ | / .\r\n"
				+ "		            .'.;.`.       ._. ! ._.       \\          .__\\:/__.\r\n"
				+ "		             `,:.'         ._\\!/_.                     .';`.      . ' .\r\n"
				+ "		             ,'             . ! .        ,.,      ..======..       .:.\r\n"
				+ "		            ,                 .         ._!_.     ||::: : | .        ',\r\n"
				+ "		     .====.,                  .           ;  .~.===: : : :|   ..===.\r\n"
				+ "		     |.::'||      .=====.,    ..=======.~,   |\"|: :|::::::|   ||:::|=====|\r\n"
				+ "		  ___| :::|!__.,  |:::::|!_,   |: :: ::|\"|l_l|\"|:: |:;;:::|___!| ::|: : :|\r\n"
				+ "		 |: :|::: |:: |!__|; :: |: |===::: :: :|\"||_||\"| : |: :: :|: : |:: |:::::|\r\n"
				+ "		 |:::| _::|: :|:::|:===:|::|:::|:===F=:|\"!/|\\!\"|::F|:====:|::_:|: :|::__:|\r\n"
				+ "		 !_[]![_]_!_[]![]_!_[__]![]![_]![_][I_]!//_:_\\\\![]I![_][_]!_[_]![]_!_[__]!\r\n"
				+ "		 -----------------------------------\"---''''```---\"-----------------------\r\n"
				+ "		 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ |= _ _:_ _ =| _ _ _ _ _ _ _ _ _ _ _ _\r\n"
				+ "		                                     |=    :    =|                        \r\n"
				+ "		_____________________________________L___________J________________________\r\n"
				+ "		--------------------------------------------------------------------------\r\n";
		
		System.out.println("\n\n");
		System.out.println(firework);
		System.out.println("\n\n");
		Thread.sleep(200);
		System.out.println("			강변을 지나간다. 앗, 저게 뭐지? ");
		Thread.sleep(2000);
		System.out.println("			불꽃놀이 축제다! 와 너무 아름답다! ");
		Thread.sleep(2000);
		System.out.println();		Thread.sleep(200);
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c4e1 = sc.nextInt();
		if(c4e1==0) {
		}
		
		String runIntoFriend =   
				  "		                                 .''.\r\n"
				+ "		       .''.             *''*    :_\\/_:     . \r\n"
				+ "		      :_\\/_:   .    .:.*_\\/_*   : /\\ :  .'.:.'.\r\n"
				+ "		  .''.: /\\ : _\\(/_  ':'* /\\ *  : '..'.  -=:o:=-\r\n"
				+ "		 :_\\/_:'.:::. /)\\*''*  .|.* '.\\'/.'_\\(/_'.':'.'\r\n"
				+ "		 : /\\ : :::::  '*_\\/_* | |  -= o =- /)\\    '  *\r\n"
				+ "		  '..'  ':::'   * /\\ * |'|  .'/.\\'.  '._____\r\n"
				+ "		      *        __*..* |  |     :      |.   |' .---\"|\r\n"
				+ "		       _*   .-'   '-. |  |     .--'|  ||   | _|    |\r\n"
				+ "		    .-'|  _.|  |    ||   '-__  |   |  |    ||      |\r\n"
				+ "		    |' | |.    |    ||       | |   |  |    ||      |\r\n"
				+ "		                             -+*###*+=-.                    \r\n"
				+ "		                           .+#%%%%%%%%%%+                   \r\n"
				+ "		                           .=#%%%%%%%%%%%=                  \r\n"
				+ "		                           .:*%%%%%%%%%%%*                  \r\n"
				+ "		                          :::==#%%%%%%%%%%.                 \r\n"
				+ "		                         .:::=*%%%%%%%%%%%*.                \r\n"
				+ "		                          :::#%%%%%%%%%%%%%+:.              \r\n"
				+ "		                             *%%%%%%%%%%%%%%#=:.            \r\n"
				+ "		                             *%%%%%%%%%%%%%%%=:...          \r\n"
				+ "		                         :=-:+%%%%%%%%%%%%%%%%#-...         \r\n"
				+ "		                         .=*-=#%%%%%%%%%%%%%%%%%*:          \r\n"
				+ "		                         ..*+.+#%+%%%%%%%%%%%%%*=.          \r\n"
				+ "		                        ...**  --.+#%%%%#+=-:.              \r\n"
				+ "		                        ...**=-----=+*-:.                   \r\n"
				+ "		                        ..:***********-.                    \r\n"
				+ "		                       ...************=                     \r\n"
				+ "		                       ..=************=                     \r\n"
				+ "		                 -+*=.  -*************+                     \r\n"
				+ "		               :*###= .:***************                     \r\n"
				+ "		             .+*###+ .-****************                     \r\n";
		
		
		// 친구 만남!! 
		System.out.println("\n");
		System.out.println(runIntoFriend);
		System.out.println("\n");
		Thread.sleep(200);
		System.out.println("			불꽃놀이를 보고 있는 친구 [인프제]를 만났다!");
		Thread.sleep(200);
		System.out.println("			[인프제]에게 말을 건다");
		Thread.sleep(200);
		System.out.println("			[영웅이] Hey~ ");
		Thread.sleep(200);
		System.out.println();		
		Thread.sleep(200);
		System.out.println("			넘어가기 [0] ");
		int c4e2 = sc.nextInt();
		if(c4e2==0) {
		}
		
		String infj = 
				  "		                    ,-------.\r\n"
				+ "		                 __/#########\\\r\n"
				+ "		               _/#############\\\r\n"
				+ "		              /################|\r\n"
				+ "		             /##################\\\r\n"
				+ "		            /####################\\\r\n"
				+ "		           /##########/..'|#######|\r\n"
				+ "		          |##########|..   \\#######|\r\n"
				+ "		          |#########/       |######|\r\n"
				+ "		         |#########|  ..     .\\##~#|\r\n"
				+ "		         |########/  ..   __, .|#:||\r\n"
				+ "		         |#######|-.    ,/ _   |#:|#\\\r\n"
				+ "		         |#######/W>::  .<W/.  |/;'##|\r\n"
				+ "		         |######|  .;;   `     'w'###|\r\n"
				+ "		         |######|  ,;'  . ..   |#####|\r\n"
				+ "		         |######|  ;(   _).    |#####\\\r\n"
				+ "		         |######|  . `-'   `   |######`\r\n"
				+ "		         |######\\ .  _;_       /#######\r\n"
				+ "		        /########\\  <-(,\\`;   /########\r\n"
				+ "		       |#########|\\,--.\\;`.  /|########\r\n"
				+ "		      /##########/;;-.;\\\\.;\\  |########\r\n"
				+ "		     |######/`/~'  ;(\\\\. \\\\.`.|########\r\n"
				+ "		    /######/|/| ;  (\\\\;\\\\  ,' \\######A#\r\n"
				+ "		   /##|\\#| / /  :   \\;\\ `  . .:#####| \\\r\n"
				+ "		   |##\\ ||.__|      :\\ , '     |####/ ;\r\n"
				+ "		   |#| \\//   .\\      :\\.       |###| ;'\r\n"
				+ "		   |#| ||..   .\\      ;;\\.  .  |###|; /\r\n";
		System.out.println(infj);
		System.out.println("\n");
		Thread.sleep(200);
		System.out.println("			[인프제] 의 낯빛이 급격히 어두워졌다. ");
		Thread.sleep(1000);
		System.out.println("			[영웅이] (쫑알쫑알) (주절주절) ");
		Thread.sleep(1000);
		System.out.println("			[영웅이] 요기서 모해~ 잘됐다~ 나랑 놀자! 마트 같이 가자 ");
		Thread.sleep(1000);
		System.out.println("			[인프제] 아... (슈발) 엔프피 김영웅때문에 기빨린다.... 빨리 집에 가고 싶은데(흑흑)");
		Thread.sleep(1000);
		System.out.println("			[미니게임3] 친구랑 설득해서 같이 마트 가기~! - 친구가 좋아하는 영화맞추기 !!");
		Thread.sleep(1000);
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c4e3 = sc.nextInt();
		if(c4e3==0) {
		}

		
		// 친구한테 마트 가자고 조른다~~~!  설득하기!!
		// 미니게임3. 영친구가 좋아하는 영화맞추기5문제만.
		
		// 이겼으면 [인프제] "(헐~ 감동이야...) 역시 우리는 최고의 친구!!" (마트 같이 감)
		// 졌으면  [친구] "헐.. 나에 대해 하나도 모르다닝 실망이얌!!!"(친구 삐져서 집에 감)
		
		String withfriend = 
				  "			                               |\r\n"
				+ "			                            \\  '  /\r\n"
				+ "			         __  __               .-.\r\n"
				+ "			        _\\ \\/ /_  __    -=== (   ) ===-\r\n"
				+ "			       /__oOoo__\\/ /__        '-' \r\n"
				+ "			         /_/\\__\\oOo__/      /  .  \\\r\n"
				+ "			           || /_/\\__\\          |\r\n"
				+ "			           ||   ||\r\n"
				+ "			       ~^~~||~^~||^~^^~^~^=^=^~=~=~^=^~^~^~^~^~^~^~^~^\r\n"
				+ "			       ~^ ~|| ~~||  ~^~  ~^= =~^=~^~^= ~^~^~  ~^~^ ~^~\r\n"
				+ "			        ^~ || ^ ||~^ ~^~  ~^==~^==~^~ = ~^=~ ~^  ~^~\r\n"
				+ "			       .'. ||.'.||.' ..'..''.'.'.  '.'..'.'  .'''..''.'\r\n"
				+ "			       jgs ||   || ''.  O ~O/    ''       ''\r\n"
				+ "			           ||          /|\\/|  '   .     '     .    '\r\n"
				+ "			        .      '   .   /|  |\\         .    .      '\r\n"
				+ "			           .          / | / | .               .\r\n"
				+ "			       '        '     ` ` ` `       '             '";
		
		System.out.println("\n\n");
		System.out.println(withfriend);
		System.out.println("\n\n");
		Thread.sleep(200);
		System.out.println("			친구가 좋아하는 영화 맞추기 퀴즈 대성공!");
		System.out.println();
		Thread.sleep(200);
		System.out.println("			[인프제] (헐~ 감동이야...) 평소에 날 이렇게 생각해주고 있었다니....");
		Thread.sleep(200);
		System.out.println("			친구와 함께 마트에 간다.");
		Thread.sleep(200);
		System.out.println();		
		Thread.sleep(200);
		System.out.println("			넘어가기 [0] ");
		int c4e4 = sc.nextInt();
		if(c4e4==0) {
		}
		
		///////////////////////////////////// chapter.5 마트에서
		String store = 
				  "			⠀⠀⢀⣀⣀⣀⣀⣀⣀⣠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⣀⣀⣀⣀⣀⣀⡀⠀⠀\r\n"
				+ "			⠀⠀⢠⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⡄⠀⠀\r\n"
				+ "			⠀⠀⣿⣿⣿⣿⣿⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⢹⣿⣿⣿⣿⡟⣿⣿⣿⣿⣿⠀⠀\r\n"
				+ "			⠀⠀⣿⣿⣿⣿⡟⢸⣿⣿⣿⣿⢹⣿⣿⣿⣿⡘⣿⣿⣿⣿⡇⢻⣿⣿⣿⣿⠀⠀\r\n"
				+ "			⠀⢀⣛⣛⣛⣛⠃⣛⣛⣛⣛⡋⠈⣛⣛⣛⣛⠁⢛⣛⣛⣛⣛⠘⣛⣛⣛⣛⡀⠀\r\n"
				+ "			⠀⠈⠻⠿⠿⠋⣀⠈⠻⠿⠟⢁⡀⠙⠿⠿⠋⢀⡈⠻⠿⠟⠁⣀⠙⠿⠿⠟⠁⠀\r\n"
				+ "			⠀⢸⣷⣦⣶⣿⣿⣿⣶⣤⣶⣿⣿⣷⣦⣴⣾⣿⣿⣶⣤⣶⣿⣿⣿⣶⣴⣾⡇⠀\r\n"
				+ "			⠀⢸⣿⡏⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⡉⢹⣿⠉⣉⣉⣉⣉⣉⢹⣿⡇⠀\r\n"
				+ "			⠀⢸⣿⡇⣿⠉⢉⣩⣭⣽⣿⣿⣿⣿⣿⣿⣿⡇⢸⣿⠀⣿⣿⣿⣿⣿⢸⣿⡇⠀\r\n"
				+ "			⠀⢸⣿⡇⣿⢀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⢸⣿⠀⠿⠿⠿⠿⠿⢸⣿⡇⠀\r\n"
				+ "			⠀⢸⣿⡇⣿⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⢸⣿⠀⠶⠶⠶⠶⠶⢸⣿⡇⠀\r\n"
				+ "			⠀⢸⣿⡇⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⢸⣿⠀⣶⣶⣶⣶⣶⢸⣿⡇⠀\r\n"
				+ "			⠀⢸⣿⣷⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣾⣿⠀⣿⣿⣿⣿⣿⢸⣿⡇⠀\r\n"
				+ "			⠀⠈⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠀⠉⠉⠉⠉⠉⠈⠉⠁⠀";
		
		System.out.println("\n\n\n");
		System.out.println(store);
		System.out.println("\n\n\n");
		Thread.sleep(200);
		System.out.println("			친구와 마트에 도착했다!");
		System.out.println("			두부를 사러 가자!");
		System.out.println();		Thread.sleep(200);
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c5e1 = sc.nextInt();
		if(c5e1==0) {
		}

		String cart = 
				  "			                 $$$$$$$$\r\n"
				+ "			                $$$$$$$$$$\r\n"
				+ "			               $$$$$$$$$$$$\r\n"
				+ "			               $$ 0    0 $$\r\n"
				+ "			               $$   ()   $$\r\n"
				+ "			                $ \\    / $\r\n"
				+ "			                $  \\__/  $\r\n"
				+ "			                 \\______/\r\n"
				+ "			              _____!  !_____\r\n"
				+ "			              !            !\r\n"
				+ "			              !  !      !  !\r\n"
				+ "			              /  !      /  !\r\n"
				+ "			             /  /      /  /\r\n"
				+ "			            /_ /______/_ /\r\n"
				+ "			          | @@@       @@@|\r\n"
				+ "			         /0000000000000000\\\r\n"
				+ "			        /    _____       / \\\r\n"
				+ "			       /    /____/|     /   \\\r\n"
				+ "			      /     |   | |    /    /\\\r\n"
				+ "			     /      |___|/    /    //00\\\r\n"
				+ "			    /                /    / \\__/\r\n"
				+ "			    00000000000000000    /   /\r\n"
				+ "			    |               |   /   /\r\n"
				+ "			    |               |  /   /\r\n"
				+ "			    |               | /   /\r\n"
				+ "			    |               |/   /\r\n"
				+ "			 /00\\0000000000000000/00\\\r\n"
				+ "			 \\__/oooooooooooooooo\\__/\r\n";
		System.out.println("\n\n\n");
		System.out.println(cart);
		System.out.println("\n\n\n");
		Thread.sleep(200);
		System.out.println("			두부를 카트에 담았다.");
		Thread.sleep(200);
		System.out.println();
		System.out.println("			다른 것도 살까?");
		System.out.println("			[1] 콘푸로스트				[2] 친구가 갖고싶어 하는 꽃머리핀				");
		System.out.println("			[3] 범상치않은 에그몽 초콜릿        		[4] 음료수 ");

		String cereal = 
				  "			              _______________\r\n"
				+ "			             / /   콘      / /'.\r\n"
				+ "			            | |     푸   | |  |\r\n"
				+ "			            | |     로   | |  |\r\n"
				+ "			            | |     스   | | @|\r\n"
				+ "			            | |     트   | |@%@\r\n"
				+ "			            | |    __)   | |@%@%@.-.-.-.-.\r\n"
				+ "			             \\_\\_________\\_\\@%@%@%_ _ _ _.' ";
		
		String soju = 
				  "			             [=]\r\n"
				+ "			             | |\r\n"
				+ "			             }@{\r\n"
				+ "			            /   \\\r\n"
				+ "			            :___;\r\n"
				+ "			            |&&&|\r\n"
				+ "			            |&&&|\r\n"
				+ "			            |---|\r\n"
				+ "			            '---'\r\n";		
		
		String hairpin = 
				  "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡞⠉⠊⢱⠀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠏⠑⢷⠀⠀⡸⠋⠀⠸⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢅⡀⠀⠀⡷⠒⢧⣀⣀⡤⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠞⠛⠉⢇⣀⣸⠁⠀⠉⠳⡄⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠓⡄⠀⣠⡎⠀⠈⢧⣄⣠⠎⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⠊⠁⣇⣀⡀⡸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣀⣀⠀⠀⠘⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⢟⠲⢄⡀⠉⠲⡄⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠣⡀⠈⠓⢤⡈⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠓⠢⠤⠬⢿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘⠄⠀⠀\r\n";
		
		String eggmong = 
				  "                                ████████                                  \r\n"
				+ "                              ██        ██                                \r\n"
				+ "                            ██▒▒▒▒        ██                              \r\n"
				+ "                          ██▒▒▒▒▒▒      ▒▒▒▒██                            \r\n"
				+ "                          ██▒▒▒▒▒▒      ▒▒▒▒██                            \r\n"
				+ "                        ██  ▒▒▒▒        ▒▒▒▒▒▒██                          \r\n"
				+ "                        ██                ▒▒▒▒██                          \r\n"
				+ "                      ██▒▒      ▒▒▒▒▒▒          ██                        \r\n"
				+ "                      ██      ▒▒▒▒▒▒▒▒▒▒        ██                        \r\n"
				+ "                      ██      ▒▒▒▒▒▒▒▒▒▒    ▒▒▒▒██                        \r\n"
				+ "                      ██▒▒▒▒  ▒▒▒▒▒▒▒▒▒▒  ▒▒▒▒▒▒██                        \r\n"
				+ "                        ██▒▒▒▒  ▒▒▒▒▒▒    ▒▒▒▒██                          \r\n"
				+ "                        ██▒▒▒▒            ▒▒▒▒██                          \r\n"
				+ "                          ██▒▒              ██                            \r\n"
				+ "                            ████        ████                              \r\n"
				+ "                                ████████             \r\n";
		
		int c5e2 = sc.nextInt();
		if(c5e2==1) {
			System.out.println("\n\n\n");
			System.out.println(cereal);
			System.out.println("\n\n\n");
			Thread.sleep(200);
			System.out.println("			콘푸로스트를 카트에 담았다.");
			System.out.println("			계산대로 가자");
			pickClass = 1;
			
		} else if(c5e2==2) {
			System.out.println("\n\n\n");
			System.out.println(hairpin);
			System.out.println("\n\n\n");
			Thread.sleep(200);
			System.out.println("			꽃머리핀을 카트에 담았다.");
			System.out.println("			계산대로 가자");
			pickClass = 2;
			
		} else if(c5e2==3) {
			System.out.println("\n\n\n");
			System.out.println(eggmong);
			System.out.println("\n\n\n");
			Thread.sleep(200);
			System.out.println("			범상치 않은 에그몽을 카트에 담았다.");
			System.out.println("			계산대로 가자");
			pickClass = 3;
			
		} else if(c5e2==4) {
			System.out.println("\n\n\n");
			System.out.println(soju);
			System.out.println("\n\n\n");
			Thread.sleep(200);
			System.out.println("			음료수를 카트에 담았다.");
			System.out.println("			계산대로 가자");
			pickClass = 4;
		}
	
		System.out.println();		Thread.sleep(200);
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int next52 = sc.nextInt();
		if(next52==0) {
		}
		
		String counter = 
				  "			                   //////\r\n"
				+ "			             <====//////====[]\r\n"
				+ "			                 /////\\\\\\\\\\\r\n"
				+ "			               ((((( ))))))))\r\n"
				+ "			               ||| /\\   /\\ ||\r\n"
				+ "			               || |_O| |O_|||\r\n"
				+ "			              (9|     ^    |6)\r\n"
				+ "			                 \\    V   /                          \r\n"
				+ "			                 (~~~~~~~~~)                   \r\n"
				+ "			                /~~~~~~~~~~~\\                    \r\n"
				+ "			              ///////|||\\\\\\\\\\\\\\                 \r\n"
				+ "			            //                 \\\\                \r\n"
				+ "			      ______|~~~|____________|~~~|_________      \r\n"
				+ "			    []#=====`^^^'============`^^^'========#[]    \r\n"
				+ "			  __[]_____________________________________[]___(___)_\r\n"
				+ "			 [____________________________________________________]\r\n"
				+ "			   )   ===========================================  (\r\n"
				+ "			  /  /'~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\\  \\\r\n"
				+ "			<__/    (___________________________)               \\__>\r\n";
		
		System.out.println("\n");
		System.out.println(counter);
		System.out.println("\n");
		Thread.sleep(200);
		System.out.println("			[계산원] 5000원입니다~!");
		System.out.println("			[영웅이] 앗....! 근데.... 지갑이 없다");
		System.out.println("			[영웅이] 어떡하지?");
		System.out.println();		
		Thread.sleep(200);
		System.out.println("			넘어가기 [0] ");
		int c5e3 = sc.nextInt();
		if(c5e3==0) {
		}
		
		String richGrandma = 
				  "			       ___	     	⠀⠀⠀⠀⠀⠀⢯⠙⠩⠀⡇⠊⠽⢖⠆⠀⠀⠀⠀⠀\r\n"
				+ "			      (___)    		⠀⠀⠀⠀ ⠀⠀⠀⠱⣠⠀⢁⣄⠔⠁⠀⠀⠀⠀⠀⠀\r\n"
				+ "			     /`   `\\  		⠀ ⠀⠀⠀⠀⠀⠀⠀⣷⣶⣾⣾⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			    /  /\"\\  \\		⠀⠀⠀⢀⡔⠙⠈⢱⡟⣧⠀⠀⠀⠀⠀⠀\r\n"
				+ "			    \\_/o o\\_/		⠀⠀⠀⠀⠀⡠⠊⠀⠀⣀⡀⠀⠘⠕⢄⠀⠀⠀⠀⠀\r\n"
				+ "			     (  _  )		⠀⠀⠀⢀⠞⠀⠀⢀⣠⣿⣧⣀⠀⠀⢄⠱⡀⠀⠀⠀\r\n"
				+ "			      `\\ /`		⠀⠀⡰⠃⠀⠀⢠⣿⠿⣿⡟⢿⣷⡄⠀⠑⢜⢆⠀⠀\r\n"
				+ "			     /\\\\V//\\		⠀⢰⠁⠀⠀⠀⠸⣿⣦⣿⡇⠀⠛⠋⠀⠨⡐⢍⢆⠀\r\n"
				+ "			    / /_ _\\ \\		⠀⡇⠀⠀⠀⠀⠀⠙⠻⣿⣿⣿⣦⡀⠀⢀⠨⡒⠙⡄\r\n"
				+ "			    \\ \\___/ /		⢠⠁⡀⠀⠀⠀⣤⡀⠀⣿⡇⢈⣿⡷⠀⠠⢕⠢⠁⡇\r\n"
				+ "			     \\/===\\/		⠸⠀⡕⠀⠀⠀⢻⣿⣶⣿⣷⣾⡿⠁⠀⠨⣐⠨⢀⠃\r\n"
				+ "			     ||   ||		⠀⠣⣩⠘⠀⠀⠀⠈⠙⣿⡏⠁⠀⢀⠠⢁⡂⢉⠎⠀\r\n"
				+ "			     ||   ||		⠀⠀⠈⠓⠬⢀⣀⠀⠀⠈⠀⠀⠀⢐⣬⠴⠒⠁⠀⠀\r\n"
				+ "			     ||___||		⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀ \r\n";
	
		System.out.println("\n\n");
		System.out.println(richGrandma);
		System.out.println("\n\n");
		Thread.sleep(500);
		System.out.println("			아까 수레를 끌던 할머니가 근사한 옷을 입고 나타난다.");
		Thread.sleep(500);
		System.out.println("			[할머니] 아니 자네는.... 아까 그 학생?");
		Thread.sleep(500);
		System.out.println("			[영웅이] 할머니께서 여기 왜...? ");
		Thread.sleep(500);
		System.out.println("			[할머니] 내가 여기 마트 사장이란다~");
		Thread.sleep(500);
		System.out.println("			[영웅이] !!! ");
		Thread.sleep(500);
		System.out.println("			[할머니] 돈 없어? 특별히 기회를 주지... ");
		Thread.sleep(500);
		System.out.println();
		System.out.println("			[미니게임4] 가위바위보 or 바카라 - 이겨서 할머니께 용돈을 받아라!! ");
		
		// 아까 할머니 도와드렸으면 할머니가 용돈 준다 
		// [할머니] 아까는 고마웠네. 옛다 용돈 5만원 FLEX~"
		// [영웅이] 할머니 감사합니다!! "
		// 미니게임 안하고 continue 
		
		// 아까 할머니 안도와줬으면 돈 얻기위한 할머니와 한판 승부
		System.out.println();		
		Thread.sleep(200);
		System.out.println("			넘어가기 [0] ");
		
		
		int c5e4 = sc.nextInt();
		if(c5e4==0) {
		}
				
		///////////////////////////////////// chapter.6 집에 가는 길
		
		// 동네로 돌아옴
		String goinghome =
				  "			                                                     ___\r\n"
				+ "			                                             ___..--'  .`.\r\n"
				+ "			                                    ___...--'     -  .` `.`.\r\n"
				+ "			                           ___...--' _      -  _   .` -   `.`.\r\n"
				+ "			                  ___...--'  -       _   -       .`  `. - _ `.`.\r\n"
				+ "			           __..--'_______________ -         _  .`  _   `.   - `.`.\r\n"
				+ "			        .`    _ /\\    -        .`      _     .`__________`. _  -`.`.\r\n"
				+ "			      .` -   _ /  \\_     -   .`  _         .` |           |`.   - `.`.\r\n"
				+ "			    .`-    _  /   /\\   -   .`        _   .`   |___________|  `. _   `.`.\r\n"
				+ "			  .`________ /__ /_ \\____.`____________.`     ___       ___  - `._____`|\r\n"
				+ "			    |   -  __  -|    | - |  ____  |   | | _  |   |  _  |   |  _ |\r\n"
				+ "			    | _   |  |  | -  |   | |.--.| |___| |    |___|     |___|    |\r\n"
				+ "			    |     |--|  |    | _ | |'--'| |---| |   _|---|     |---|_   |\r\n"
				+ "			    |   - |__| _|  - |   | |.--.| |   | |    |   |_  _ |   |    |\r\n"
				+ "			 ---``--._      |    |   |=|'--'|=|___|=|====|___|=====|___|====|\r\n"
				+ "			 -- . ''  ``--._| _  |  -|_|.--.|_______|_______________________|\r\n"
				+ "			`--._           '--- |_  |:|'--'|:::::::|:::::::::::::::::::::::|\r\n"
				+ "			_____`--._ ''      . '---'``--._|:::::::|:::::::::::::::::::::::|\r\n"
				+ "			----------`--._          ''      ``--.._|:::::::::::::::::::::::|\r\n"
				+ "			`--._ _________`--._'        --     .   ''-----..............   '\r\n"
				+ "			     `--._----------`--._.  _           -- . :''           -    ''\r\n"
				+ "			          `--._ _________`--._ :'              -- . :''      -- . ''\r\n"
				+ "			 -- . ''       `--._ ---------`--._   -- . :''\r\n"
				+ "			          :'        `--._ _________`--._:'  -- . ''      -- . ''\r\n"
				+ "			  -- . ''     -- . ''    `--._----------`--._      -- . ''     -- . ''\r\n"
				+ "			                              `--._ _________`--._\r\n"
				+ "			 -- . ''           :'              `--._ ---------`--._-- . ''    -- . ''\r\n"
				+ "			          -- . ''       -- . ''         `--._ _________`--._   -- . ''\r\n"
				+ "			:'                 -- . ''          -- . ''  `--._----------`--._\r\n";
		System.out.println(goinghome);
		Thread.sleep(200);
		System.out.println("			룰루랄라~ 드디어 집으로 가는 길!! 친구와 헤어지고 지름길로 고고");
		System.out.println();		
		Thread.sleep(200);
		System.out.println("			넘어가기 [0] ");
		int c6e1 = sc.nextInt();
		if(c6e1==0) {
		}
		
		
		String gangster = 
				  "			                 ,#####,\r\n"
				+ "			                 #_   _#\r\n"
				+ "			                 |a` `a|\r\n"
				+ "			                 |  u  |\r\n"
				+ "			                 \\  =  /\r\n"
				+ "			                 |\\___/|\r\n"
				+ "			        ___ ____/:     :\\____ ___\r\n"
				+ "			      .'   `.-===-\\   /-===-.`   '.\r\n"
				+ "			     /      .-\"\"\"\"\"-.-\"\"\"\"\"-.      \\\r\n"
				+ "			    /'             =:=             '\\\r\n"
				+ "			  .'  ' .:    o   -=:=-   o    :. '  `.\r\n"
				+ "			  (.'   /'. '-.....-'-.....-' .'\\   '.)\r\n"
				+ "			  /' ._/   \".     --:--     .\"   \\_. '\\\r\n"
				+ "			 |  .'|      \".  ---:---  .\"      |'.  |\r\n"
				+ "			 |  : |       |  ---:---  |       | :  |\r\n"
				+ "			  \\ : |       |_____._____|       | : /\r\n"
				+ "			  /   (       |----|------|       )   \\\r\n"
				+ "			 /... .|      |    |      |      |. ...\\\r\n"
				+ "			|::::/''     /     |       \\     ''\\::::|\r\n"
				+ "			'\"\"\"\"       /'    .L_      `\\       \"\"\"\"'\r\n"
				+ "			           /'-.,__/` `\\__..-'\\\r\n";
		System.out.println(gangster);
		System.out.println("\n");
		Thread.sleep(500);
		System.out.println("			음침한 뒷골목에서 불량배 출몰!!  ");
		Thread.sleep(500);
		System.out.println("			[불량배] 야 너 돈 좀 있냐");
		Thread.sleep(500);
		System.out.println("			[영웅이] (쭈굴) 없는데여... 저 아세여? ");
		Thread.sleep(500);
		System.out.println("			[불량배] 뒤져서 나오면 100원에 한대씩이다 ");
		Thread.sleep(500);
		System.out.println("			[미니게임5] 불량배와 진검승부 - 가위바위보게임 !! ");
		System.out.println();		
		Thread.sleep(500);

		// 아까 도둑 잡았으면(블랙잭 이겼으면) 경찰이 나타나서 도와준다
		// 아까 도둑 못잡았으면 
		// 미니게임5. 바카랏 다시 플레이. 
		System.out.println("			넘어가기 [0] ");
		int c6e2 = sc.nextInt();
		if(c6e2==0) {
		}
		
		
		///////////////////////////////////// Final chapter.7 집 앞에서
		
		// 집이 보인다!
		
		System.out.println("\n\n\n\n");
		System.out.println(home);
		System.out.println("\n\n\n\n");
		Thread.sleep(200);
		System.out.println("			드디어 집이 보인다!!!!"); 
		Thread.sleep(200);
		System.out.println("			오늘 너므 힘들었어.... "); // 괄호 안에 ""넣는법
		System.out.println();
		Thread.sleep(200);
		System.out.println("			넘어가기 [0] ");
		int c7e1 = sc.nextInt();
		if(c7e1==0) {	
		}
		
		// 날씨가 심상치 않다.
		
		String weather =
				  "			        ------               _____\r\n"
				+ "			       /      \\ ___\\     ___/    ___\r\n"
				+ "			    --/-  ___  /    \\/  /  /    /   \\\r\n"
				+ "			   /     /           \\__     //_     \\\r\n"
				+ "			  /                     \\   / ___     |\r\n"
				+ "			  |           ___       \\/+--/        /\r\n"
				+ "			   \\__           \\       \\           /\r\n"
				+ "			      \\__                 |          /     \r\n"
				+ "	    		     \\     /____      /  /       |   /       \r\n"
				+ "			          _____/         ___       \\/  /\\      \r\n"
				+ "				       \\__      /      /    |    |     \r\n"
				+ "			         /    \\____/   \\       /   //       \r\n"
				+ "					 // / / // / /\\    /-_-/\\//-__-                  \r\n"
				+ "			     /  /  // /   \\__// / / /  //\r\n"
				+ "					 //   / /   //   /  // / // /\r\n"
				+ "			      /// // / /   /  //  / //\r\n"
				+ "			   //   //       //  /  // / /\r\n"
				+ "			     / / / / /     /  /    /\r\n"
				+ "			  ///  / / /  //  // /  // //\r\n"
				+ "			     ///    /    /    / / / /\r\n"
				+ "			///  /    // / /  // / / /  /\r\n"
				+ "			   // ///   /      /// / /";
		System.out.println("\n");
		System.out.println(weather);
		System.out.println("\n");
		Thread.sleep(200);
		System.out.println("			근데 날씨가 심상치 않다.... !!!!"); 
		Thread.sleep(200);
		System.out.println("			비가 오고 천둥번개가 친다!! "); 
		System.out.println();
		Thread.sleep(200);
		System.out.println("			넘어가기 [0] ");
		int c7e2 = sc.nextInt();
		if(c7e2==0) {	
		}
		
		
		// 헉... 용이 나타났다!!!
		
		String dragon1 = 
				
				  "		                                                 /===-_---~~~~~~~~~------____\r\n"
				+ "		                                                |===-~___                _,-'\r\n"
				+ "		                 -==\\\\                         `//~\\\\   ~~~~`---.___.-~~\r\n"
				+ "		             ______-==|                         | |  \\\\           _-~`\r\n"
				+ "		       __--~~~  ,-/-==\\\\                        | |   `\\        ,'\r\n"
				+ "		    _-~       /'    |  \\\\                      / /      \\      /\r\n"
				+ "		  .'        /       |   \\\\                   /' /        \\   /'\r\n"
				+ "		 /  ____  /         |    \\`\\.__/-~~ ~ \\ _ _/'  /          \\/'\r\n"
				+ "		/-'~    ~~~~~---__  |     ~-/~         ( )   /'        _--~`\r\n"
				+ "		                  \\_|      /        _)   ;  ),   __--~~\r\n"
				+ "		                    '~~--_/      _-~/-  / \\   '-~ \\\r\n"
				+ "		                   {\\__--_/}    / \\\\_>- )<__\\      \\\r\n"
				+ "		                   /'   (_/  _-~  | |__>--<__|      |\r\n"
				+ "		                  |0  0 _/) )-~     | |__>--<__|      |\r\n"
				+ "		                  / /~ ,_/       / /__>---<__/      |\r\n"
				+ "		                 o o _//        /-~_>---<__-~      /\r\n"
				+ "		                 (^(~          /~_>---<__-      _-~\r\n"
				+ "		                ,/|           /__>--<__/     _-~\r\n"
				+ "		             ,//('(          |__>--<__|     /                  .----_\r\n"
				+ "		            ( ( '))          |__>--<__|    |                 /' _---_~\\\r\n"
				+ "		         `-)) )) (           |__>--<__|    |               /'  /     ~\\`\\\r\n"
				+ "		        ,/,'//( (             \\__>--<__\\    \\            /'  //        ||\r\n"
				+ "		      ,( ( ((, ))              ~-__>--<_~-_  ~--____---~' _/'/        /'\r\n"
				+ "		    `~/  )` ) ,/|                 ~-_~>--<_/-__       __-~ _/\r\n"
				+ "		  ._-~//( )/ )) `                    ~~-'_/_/ /~~~~~~~__--~\r\n"
				+ "		   ;'( ')/ ,)(                              ~~~~~~~~~~\r\n"
				+ "		  ' ') '( (/\r\n"
				+ "		    '   '  `\r\n";
		
		
		System.out.println(dragon1);
		Thread.sleep(1000);
		System.out.println("			!!!!!!!! "); 
		Thread.sleep(1000);
		System.out.println("			위험 상황!! 전설의 용 [드라카이나(Drakaina)]가 집 앞에 출몰했다. "); // 괄호 안에 ""넣는법
		Thread.sleep(1000);
		System.out.println("			넘어가기 [0] ");
		int c7e3 = sc.nextInt();
		if(c7e3==0) {	
		}
		
		String finalboss =
				
				  "		        ██╗    ██╗ █████╗ ██████╗ ███╗   ██╗██╗███╗   ██╗ ██████╗ ██╗                 \r\n"
				+ "		        ██║    ██║██╔══██╗██╔══██╗████╗  ██║██║████╗  ██║██╔════╝ ██║                 \r\n"
				+ "		        ██║ █╗ ██║███████║██████╔╝██╔██╗ ██║██║██╔██╗ ██║██║  ███╗██║                 \r\n"
				+ "		        ██║███╗██║██╔══██║██╔══██╗██║╚██╗██║██║██║╚██╗██║██║   ██║╚═╝                 \r\n"
				+ "		        ╚███╔███╔╝██║  ██║██║  ██║██║ ╚████║██║██║ ╚████║╚██████╔╝██╗                 \r\n"
				+ "		         ╚══╝╚══╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝╚═╝╚═╝  ╚═══╝ ╚═════╝ ╚═╝                 \r\n"
				+ "		                                                                                      \r\n"
				+ "		███████╗██╗███╗   ██╗ █████╗ ██╗         ██████╗  ██████╗ ███████╗███████╗         ██╗\r\n"
				+ "		██╔════╝██║████╗  ██║██╔══██╗██║         ██╔══██╗██╔═══██╗██╔════╝██╔════╝         ██║\r\n"
				+ "		█████╗  ██║██╔██╗ ██║███████║██║         ██████╔╝██║   ██║███████╗███████╗         ██║\r\n"
				+ "		██╔══╝  ██║██║╚██╗██║██╔══██║██║         ██╔══██╗██║   ██║╚════██║╚════██║         ╚═╝\r\n"
				+ "		██║     ██║██║ ╚████║██║  ██║███████╗    ██████╔╝╚██████╔╝███████║███████║██╗██╗██╗██╗\r\n"
				+ "		╚═╝     ╚═╝╚═╝  ╚═══╝╚═╝  ╚═╝╚══════╝    ╚═════╝  ╚═════╝ ╚══════╝╚══════╝╚═╝╚═╝╚═╝╚═╝╗\r\n";
	
		System.out.println("\n\n\n\n\n");
		Thread.sleep(200);
		System.out.println("		        ██╗    ██╗ █████╗ ██████╗ ███╗   ██╗██╗███╗   ██╗ ██████╗ ██╗                 ");
		Thread.sleep(200);
		System.out.println("		        ██║    ██║██╔══██╗██╔══██╗████╗  ██║██║████╗  ██║██╔════╝ ██║                 ");
		Thread.sleep(200);
		System.out.println("		        ██║ █╗ ██║███████║██████╔╝██╔██╗ ██║██║██╔██╗ ██║██║  ███╗██║                 ");
		Thread.sleep(200);
		System.out.println("		        ██║███╗██║██╔══██║██╔══██╗██║╚██╗██║██║██║╚██╗██║██║   ██║╚═╝                 ");
		Thread.sleep(200);
		System.out.println("		        ╚███╔███╔╝██║  ██║██║  ██║██║ ╚████║██║██║ ╚████║╚██████╔╝██╗                 ");
		Thread.sleep(200);
		System.out.println("		         ╚══╝╚══╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝╚═╝╚═╝  ╚═══╝ ╚═════╝ ╚═╝                 ");
		Thread.sleep(200);
		System.out.println("		                                                                                      ");
		Thread.sleep(200);
		System.out.println("		███████╗██╗███╗   ██╗ █████╗ ██╗         ██████╗  ██████╗ ███████╗███████╗         ██╗");
		Thread.sleep(200);
		System.out.println("		██╔════╝██║████╗  ██║██╔══██╗██║         ██╔══██╗██╔═══██╗██╔════╝██╔════╝         ██║");
		Thread.sleep(200);
		System.out.println("		█████╗  ██║██╔██╗ ██║███████║██║         ██████╔╝██║   ██║███████╗███████╗         ██║");
		Thread.sleep(200);
		System.out.println("		██╔══╝  ██║██║╚██╗██║██╔══██║██║         ██╔══██╗██║   ██║╚════██║╚════██║         ╚═╝");
		Thread.sleep(200);
		System.out.println("		██║     ██║██║ ╚████║██║  ██║███████╗    ██████╔╝╚██████╔╝███████║███████║██╗██╗██╗██╗");
		Thread.sleep(200);
		System.out.println("		╚═╝     ╚═╝╚═╝  ╚═══╝╚═╝  ╚═╝╚══════╝    ╚═════╝  ╚═════╝ ╚══════╝╚══════╝╚═╝╚═╝╚═╝╚═╝╗");
		Thread.sleep(200);
		System.out.println("\n\n\n\n\n");
		
		System.out.println("			넘어가기 [0] ");
		int c7e4 = sc.nextInt();
		if(c7e4==0) {	
		}
		// 용이 불 뿜는 모습.... 
		
		String dragon2 = 
				  "			   (  )   /\\   _                 (     \r\n"
				+ "			    \\ |  (  \\ ( \\.(               )                      _____\r\n"
				+ "				  \\  \\ \\  `  `   ) \\             (  ___                 / _   \\\r\n"
				+ "			 (_`    \\+   . x  ( .\\            \\/   \\____-----------/ (o)   \\_\r\n"
				+ "			- .-               \\+  ;          (  O                           \\____\r\n"
				+ "			                          )        \\_____________  `              \\  /\r\n"
				+ "			(__                +- .( -'.- <. - _  VVVVVVV VV V\\                 \\/\r\n"
				+ "			(_____            ._._: <_ - <- _  (--  _AAAAAAA__A_/                  |\r\n"
				+ "			  .    /./.+-  . .- /  +--  - .     \\______________//_              \\_______\r\n"
				+ "			  (__ ' /x  / x _/ (                                  \\___'          \\     /\r\n"
				+ "			 , x / ( '  . / .  /                                      |           \\   /\r\n"
				+ "			    /  /  _/ /    +                                      /              \\/\r\n"
				+ "			   '  (__/                                             /                  \\\r\n";
		System.out.println("\n\n\n\n\n");
		System.out.println(dragon2);
		System.out.println("\n\n\n\n\n");
		Thread.sleep(1000);
		System.out.println("			[드라카이나(Drakaina)]가 포효하고 있습니다.");
		Thread.sleep(1000);
		System.out.println("			[드라카이나(Drakaina)]가 [분노의화염]을 시전합니다.");
		Thread.sleep(1000);
		System.out.println("			빨리 [드라카이나(Drakaina)]와의 전투를 준비하세요!! "); 
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			넘어가기 [0] ");
		int c7e5 = sc.nextInt();
		if(c7e5==0) {	
		}
		// 마트에서 산 것은 용 출몰(hp3000) 했을 때 클래스(직업) 결정/크리티컬 스킬 결정
		// [1] 콘푸로스트     [2] 에그몽 초콜릿     [3] 친구꺼 헤어핀    [4] 참이슬
		// [1] 콘푸로스트 : 호랑이 기운 솟아남. 당신의 직업은 [드루이드] [호랑이로 변신함] 야생의영혼-500 
		// [2] 헤어핀 : 친구가 헤어핀 착용하고 절세미녀가 됨. [친구가 	흑마법사] 거부할수없는유혹-500 // careless whisper
		// [3] 에그몽 : 에그몽 부화함. 유니콘이 나와서 타고 싸움. [성기사] [유니콘을 탐] 빛의심판-500
		// [4] 참이슬 : 마시면 알 수 없는 용기가 올라감. [겁대가리상실한 타락휴먼] 용감무쌍-50
		
		// 집에서 들고 나온 것은 용 출몰(hp3000) 시 무기 결정.
		// [1] 우산 : 우산으로 공격~ - 100 [슉슉] // 휘두르는 사운드
		// [2] 건틀렛 : 가시주먹 공격~ - 200 [퍽퍽] // 때리는 사운드
		// [3] 광선검 : 광선검 어택~ - 300 [주황주황] // 롤 바드 지잉 사운드
		// [4] 전설의검 : 전설의검 어택~ - 250 [쨍그랑] // 검 사운드
		
		// hp회복하는 기법(안함)
		// [1] 콘푸로스트 hp 300 회복 
		// [2] 에그몽 hp 300 회복
		// [3] 거울보기 hp 300 회복
		// [4] 소주마시면 hp 500 회복
		
		// 와일문 트루인동안 내가 한 번 공격하면, 드라카이나도 나를 한 번 공격한다.(내hp 1500)
		// 드라카이나 [분노의화염] 시전하면 (내hp-300씩 감소) 
		// 드라카이나 [썬더라이트닝] 시전하면 (내hp-500씩 감소-크리티컬)
		
		if(pickClass==1) { // 직업선택
			
			String druid = 
					"			     .      .\r\n"
				  + "			     |\\____/|\r\n"
				  + "			    (\\|----|/)\r\n"
				  + "			     \\ 0  0 /\r\n"
				  + "			      |    |\r\n"
				  + "			   ___/\\../\\____\r\n"
				  + "			  /     --       \\\r\n"
				  + "			 /  \\         /   \\\r\n"
				  + "			|    \\___/___/(   |\r\n"
				  + "			\\   /|  }{   | \\  )\r\n"
				  + "			 \\  ||__}{__|  |  |\r\n"
				  + "			  \\  |;;;;;;;\\  \\ / \\_______\r\n"
				  + "			   \\ /;;;;;;;;| [,,[|======'\r\n"
				  + "			     |;;;;;;/ |     /\r\n"
				  + "			     ||;;|\\   |\r\n"
				  + "			     ||;;/|   /\r\n"
				  + "			     \\_|:||__|\r\n"
				  + "			      \\ ;||  /\r\n"
				  + "			      |= || =|\r\n"
				  + "			      |= /\\ =|\r\n"
				  + "			      /_/  \\_\\";
			
			System.out.println("\n\n");
			System.out.println(druid);
			System.out.println("\n\n");
			Thread.sleep(1000);
			System.out.println("			[영웅이] 콘푸로스트를 먹는다. "); 
			Thread.sleep(1000);
			System.out.println("			[영웅이] 호랑이 기운이 솟아난다! "); 
			Thread.sleep(1000);
			System.out.println("			전투게이지 상승!!");
			Thread.sleep(1000);
			System.out.println("			당신의 직업은 이제부터 [드루이드]입니다");
			System.out.println();
			System.out.println("			넘어가기 [0] ");
			int c7e6 = sc.nextInt();
			if(c7e6==0) {	
			}
			
			String tiger = 
					"			⠀⠀⠀⣰⣟⠲⠤⣤⣤⣤⠶⢖⣲⣶⡶⢶⣶⣖⡲⠶⣤⣤⣤⡤⠖⡛⣆⠀⠀⠀\r\n"
							+ "			⠀⠀⠀⡏⣿⣷⣄⠀⡟⢡⡶⠛⠉⠁⠀⠀⠈⠉⠛⢶⡌⠻⠀⣠⣾⣿⢹⠀⠀⠀\r\n"
							+ "			⠀⠀⠀⡇⢹⣿⣿⠆⣠⠞⢁⣀⣠⣤⡴⢦⣤⣄⣀⡈⠳⣄⢰⣿⣿⣟⢸⡄⠀⠀\r\n"
							+ "			⠀⠀⠀⢻⣤⡻⠁⡸⢃⠜⠋⠉⠉⣠⠀⠐⣄⠉⠉⠙⠢⡘⢧⡙⣿⣣⡿⠀⠀⠀\r\n"
							+ "			⠀⠀⢀⣾⡷⠁⠊⠀⠀⠤⠖⠋⠉⠑⡀⢀⠊⠉⠙⠲⠤⠀⠀⠑⠀⢾⣷⡄⠀⠀\r\n"
							+ "			⠀⠀⣴⡿⠃⠀⡀⣀⡴⠁⣤⠶⠚⠋⠀⠀⠙⠓⠶⣤⠈⢦⣀⢀⠀⠘⢿⣦⠀⠀\r\n"
							+ "			⢀⣾⠏⠀⣰⡟⢰⢏⣀⡐⠁⠀⠀⠀⠀⠀⠀⠀⡀⠈⢂⣀⡙⡆⢻⣆⠀⠹⣷⡀\r\n"
							+ "			⣼⡏⠀⠀⣿⣧⠸⠀⠻⣏⠟⣾⣄⠀⠀⠀⠀⣠⣷⠻⣹⠟⠀⠇⣼⣷⡀⠀⢹⣷\r\n"
							+ "			⣿⣰⠀⠀⣿⣿⡇⠀⠀⠉⠉⢹⣿⠀⠀⠀⠀⣿⡏⠉⠉⠀⠀⢸⣿⣿⠁⠀⣆⣿\r\n"
							+ "			⢻⢿⣠⠀⠀⣿⣯⠁⠀⠀⢀⡞⠀⠀⠀⠀⠀⠈⢷⡀⠀⠀⠊⣽⣿⠁⠀⡀⡿⡟\r\n"
							+ "			⠈⢸⣿⡆⡀⠈⢿⣇⡀⠀⡼⢰⠀⠀⠀⠀⠀⠀⡏⢧⠀⢀⣸⡿⠃⢀⢰⣿⡗⠀\r\n"
							+ "			⠀⠈⢿⢿⣿⣦⡈⠻⢿⣄⡁⡾⠀⠀⠀⠀⠀⠀⢷⢈⣠⡿⠟⢁⣴⣿⡿⡻⠁⠀\r\n"
							+ "			⠀⠀⠀⠈⠻⠟⢿⣶⣤⣿⢇⢳⡀⠀⠀⠀⠀⢀⡞⡸⣿⣤⣶⡿⠻⠟⠁⠀⠀⠀\r\n"
							+ "			⠀⠀⠀⠀⠀⠀⠀⠀⣘⣿⣒⣂⠙⠛⢷⡾⠛⠋⢐⣒⣿⣓⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
							+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠚⣧⣖⣀⣀⣬⣧⣀⣀⣲⣽⠃⠒⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
							+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠳⢤⣄⣠⡤⠾⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀";
			System.out.println(tiger);
			
			Thread.sleep(1000);
			System.out.println("			[드루이드]는 동물 변신 마법을 씁니다.");
			Thread.sleep(1000);
			System.out.println("			호랑이로 변신합니다.");
			Thread.sleep(1000);
			System.out.println("			크리티컬 스킬 [야생의영혼(-500)]을 배웠습니다.");
			System.out.println();
			System.out.println("			넘어가기 [0] ");
			int c7e7 = sc.nextInt();
			if(c7e7==0) {	
			}
						
			//////////////////////////////// 드루이드 VS 드라카이나 
			System.out.println("			전투가 시작되었습니다.");
			System.out.println();
			Thread.sleep(1000);
			System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
			System.out.println();
			Thread.sleep(1000);
			System.out.println("			[나] HP>> " + Druid.getHp());
			System.out.println();
			Thread.sleep(1000);
			
			while(Drakaina.getHp()>0&&Druid.getHp()>0) {
				
				if(pickWeapon==1) {
					Druid.setAttack("			우산공격~!");
				} else if(pickWeapon==2) {
					Druid.setAttack("			건틀렛주먹~!");
				} else if(pickWeapon==3) {
					Druid.setAttack("			광선검어택~!");
				} else if(pickWeapon==4) {
					Druid.setAttack("			해골검어택~!");
				}
				
				int myhp = Druid.getHp();
				int drahp = Drakaina.getHp();
				System.out.println("			==========[드라카이나]의 공격==========");
				System.out.println();
				System.out.println("			[1] 일반공격                   [2] 크리티컬 ");
				int pickdra = sc.nextInt();
				Thread.sleep(200);
				if(pickdra == 1) {
					System.out.println(p.fireRage());
					myhp-=300;
					Druid.setHp(myhp);
					System.out.println();
					Thread.sleep(200);
					System.out.println("			[나] HP>> " + Druid.getHp());
					Thread.sleep(200);
//					System.out.println("포션을 먹었습니다.");
//					myhp = list.get(1).getHp()+200;
//					System.out.println("[나] HP>> " + list.get(1).getHp());
//					Thread.sleep(200);
					
				} else if(pickdra ==2 ) {
					System.out.println(p.thunderLightening());
					myhp-=500;
					Druid.setHp(myhp);
					System.out.println();
					Thread.sleep(200);
					System.out.println("			[나] HP>> " + Druid.getHp());
					Thread.sleep(200);
//					System.out.println("포션을 먹었습니다.");
//					myhp = list.get(1).getHp()+200;
//					System.out.println("[나] HP>> " + list.get(1).getHp());
//					Thread.sleep(200);
					
				}
				
				System.out.println();
				System.out.println("			==========[영웅이]의 공격==========");
				System.out.println();
				System.out.println("			[1] 무기공격                   [2] 마법공격");
				int pickattack = sc.nextInt();
				Thread.sleep(200);
				
				if(pickattack==1) { //무기공격
					
					if(pickWeapon==1) {
						System.out.println(p.umbAttack());
						drahp-=100;
						Drakaina.setHp(drahp);
						Thread.sleep(200);
					} else if(pickWeapon==2) {
						System.out.println(p.gaunAttack());
						drahp-=200;
						Drakaina.setHp(drahp);
						Thread.sleep(200);
					} else if(pickWeapon==3) {
						System.out.println(p.lightAttack());
						drahp-=300;
						Drakaina.setHp(drahp);
						Thread.sleep(200);
					} else if(pickWeapon==4) {
						System.out.println(p.swordAttack());
						drahp-=250;
						Drakaina.setHp(drahp);
						Thread.sleep(200);
					}
					
					
					System.out.println();
					Thread.sleep(500);
					System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
					Thread.sleep(500);
					System.out.println();
				} else if(pickattack==2) {
					System.out.println(p.druidAttack());
					int hp = Drakaina.getHp()-1000;
					Drakaina.setHp(hp);
					System.out.println();
					Thread.sleep(500);
					System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
					Thread.sleep(500);
					System.out.println();
					
				} if (Drakaina.getHp() <= 0) {
					System.out.println("			[영웅이]님의 승리! ");
				}
				if (Druid.getHp() <= 0) {
					System.out.println("			[드라카이나]의 승리!");
					System.out.println("			당신은 패배했습니다.....!");
				}
				
				
				
				
			}
		}
		
		if(pickClass==2) { //careless whisper
		
		String mirror = 
				  "			         ⠀⠀⠀⠀⠀⡞⠉⠊⢱⠀⣀⣀⠀⠀⠀         .::::.                        \r\n"
				+ "			           ⣰⠏⠑⢷⠀⠀⡸⠋⠀⠸⣄⠀⠀       .::::::::.                      \r\n"
				+ "			         ⠀⠘⢅⡀⠀⠀⡷⠒⢧⣀⣀⡤⠊⠀        :::::::::::                     \r\n"
				+ "			           ⣠⠞⠛⠉⢇⣀⣸⠁⠀⠉⠳⡄⠀       ':::::::::::..                  \r\n"
				+ "			          ⠀⠓⡄⠀⣠⡎⠀⠈⢧⣄⣠⠎          :::::::::::::::'               \r\n"
				+ "			            ⠑⠊⠁⣇⣀⡀⡸⠀⠀            ':::::::::::.                 \r\n"
				+ "			                                    .::::::::::::::'            \r\n"
				+ "			                                  .:::::::::::...               \r\n"
				+ "			                                 ::::::::::::::''               \r\n"
				+ "			                     .:::.       '::::::::''::::                \r\n"
				+ "			                   .::::::::.      ':::::'  '::::               \r\n"
				+ "				              .::::':::::::.    :::::    '::::.             \r\n"
				+ "			                .:::::' ':::::::::. :::::      ':::.            \r\n"
				+ "			              .:::::'     ':::::::::.:::::       '::.           \r\n"
				+ "			            .::::''         '::::::::::::::       '::.          \r\n"
				+ "		               .::''              '::::::::::::         :::...      \r\n"
				+ "			        ..::::                  ':::::::::'        .:' ''''     \r\n"
				+ "			     ..''''':'                    ':::::.'                      \r\n";
		System.out.println(mirror);
	
		Thread.sleep(1000);
		System.out.println("			어디선가 [영웅이] 의 친구 [infj]가 나타났다.  "); 
		Thread.sleep(1000);
		System.out.println("			친구 에게 헤어핀을 준다.");
		Thread.sleep(1000);
		System.out.println("			헤어핀 착용! 절세 미녀가 되었다!");
		Thread.sleep(1000);
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c7e8 = sc.nextInt();
		if(c7e8==0) {	
		}
		
		String warlock = 
				  "		⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⣦⡤⢤⣀⡈⣿⣷⣄⢰⣿⣿⣿⣿⢻⣿⣶⡿⣿⣄⠈⢻⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡈⢷⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣤⣿⣽⣧⣽⣝⣿⠻⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣻⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⣀⣄⣀⣀⣀⠀⠀⠀⠉⠛⠿⣿⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢛⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⣿⣿⣿⣿⣿⣿⣿⣷⣶⣶⣶⣿⡿⣿⣿⡿⠟⣿⣿⣿⢿⣿⣿⣿⣻⣿⠿⠿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣽⣛⣛⠛⠉⠉⠀⠈⣹⠏⠀⠀⠈⠙⠿⠛⣿⣟⣿⣿⣿⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⣶⣦⣾⣥⣀⣒⢶⡦⠤⠀⠀⠒⣬⣽⣭⣿⣿⣧⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣾⣿⣷⣾⣷⣿⣿⣿⣶⣿⣿⣿⣿⣶⣶⣶⣶⣶⣶⣤\r\n"
				+ "		⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "		⠀⠀⠙⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠉⢿⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "		⠀⠀⠀⠀⠀⠙⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⢀⣾⣿⣿⣿⣿⣿⣿⣿⠉⢿⣿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "		⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⢹⣿⣿⣿⣿⣿⣿⡇⠀⠀⠉⠀⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "		⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⡿⢿⣿⣿⣿⣿⣿⣿⣿⠿⣿⣿⣿⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\r\n"
				+ "		⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠈⠉⠻⣿⡟⠀⠘⢤⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⣺⣿⣿⣿⣿⣿⣿⡿⠿⠿⠟⠛⠛⠛\r\n"
				+ "		⠀⣀⠴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⢀⣿⠁⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⢈⡿⠁⠀⠀⠀⠀⢀⣿⠃⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠁⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀⠀⠀⢀⣾⣧⣀⣀⣾⣿⣿⣿⣿⣿⣿⣿⣿⡁⠀⢀⡾⠀⠀⠀⠀⠀⠀⢸⡿⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠉⠙⠛⠛⠁⠀⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⢿⢿⣿⢸⣿⣿⣿⣿⣿⡿⠋⠀⠀⢀⣴⣿⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠈⠹⣿⢺⣿⣿⣿⣿⠏⠀⠀⢀⡴⠿⠉⠉⢉⣉⣩⣿⣿⣝⣻⣿⣿⠻⠋⠘⠁⠀⠀⠀⠀⠀⠀⠀⠀⢠⣆⣼⣏⡀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⠀⠈⠙⣏⣿⡿⢿⠀⢀⡴⡟⠁⣀⣴⡾⠟⠋⠁⠀⠀⠈⠻⣿⣇⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⠟⣻⣿⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⠀⠀⠀⠀⠈⠁⠀⢠⡟⠁⣠⣾⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⠙⢷⡄⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣋⡾⢋⣿⡆⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⠀⠀⠀⠀⠀⠀⢠⡟⠀⣰⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⡇⠈⢿⡆⠀⠀⠀⠀⠀⠀⢀⣿⣿⡟⣰⠏⣡⣿⡄⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⠀⠀⠀⠀⠀⣴⣿⣄⣴⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠹⣌⣿⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣡⡾⣋⣴⣧⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣷⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⣀⣸⣇⠀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⠀⠀⢰⣿⣿⣿⣿⣸⣿⣿⣿⣿⣷⣤⣤⣤⣤⣤⣤⡴⢶⣾⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⣹⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⣿⣿⡶⠆⠀⠀⠀⠀⠀⢀⣒⣒⣻⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⢾⣿⣝⣿⣿⣿⣿⠋⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⢛⣵⣶⣶⣷⣶⣶⣶⠿⠛⠉⠉⠋⢸⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⢀⣼⠿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⠋⣉⣃⣠⣤⣤⣤⠶⡶⣾⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⣀⣼⣿⣶⣬⣿⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⣼⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣼⠿⠾⠛⠛⢹⣿⡇⠂⠀⠀⣻⣿⣿⣿⣿⣿⣿⣿⣿⣇⣴⣾⡏⠹⣿⣿⣿⢿⣟⠁⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⣿⣿⣶⣽⠿⣿⣿⣿⣿⣿⡟⠃⠀⠀⠀⠀⣶⣿⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⢙⣿⣿⣶⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⢿⣿⣿⣿⣷⣤⣈⣻⠿⢿⣿⣷⣤⣠⣡⠠⣾⣦⡄⠀⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢠⣀⡌⢘⣿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀";
		System.out.println(warlock);
	
		Thread.sleep(1000);
		System.out.println("			친구의 직업은 이제부터 [흑마법사]입니다.");
		Thread.sleep(1000);
		System.out.println("			당신의 친구가 당신 대신 전투에 참여합니다. ");
		Thread.sleep(1000);
		System.out.println("			크리티컬 스킬 [거부할수없는유혹-500]을 배웠습니다.");
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c7e9 = sc.nextInt();
		if(c7e9==0) {	
		}
		
		System.out.println("			전투가 시작되었습니다.");
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			[나] HP>> " + Warlock.getHp());
		System.out.println();
		Thread.sleep(1000);
		
		while(Drakaina.getHp()>0&&Warlock.getHp()>0) {
			
			if(pickWeapon==1) {
				Warlock.setAttack("			우산공격~!");
			} else if(pickWeapon==2) {
				Warlock.setAttack("			건틀렛주먹~!");
			} else if(pickWeapon==3) {
				Warlock.setAttack("			광선검어택~!");
			} else if(pickWeapon==4) {
				Warlock.setAttack("			해골검어택~!");
			}
			
			int myhp = Warlock.getHp();
			int drahp = Drakaina.getHp();
			System.out.println("			==========[드라카이나]의 공격==========");
			System.out.println();
			System.out.println("			[1] 일반공격                   [2] 크리티컬 ");
			int pickdra = sc.nextInt();
			Thread.sleep(200);
			if(pickdra == 1) {
				System.out.println(p.fireRage());
				myhp-=300;
				Warlock.setHp(myhp);
				System.out.println();
				Thread.sleep(200);
				System.out.println("			[나] HP>> " + Warlock.getHp());
				Thread.sleep(200);
//				System.out.println("포션을 먹었습니다.");
//				myhp = list.get(1).getHp()+200;
//				System.out.println("[나] HP>> " + list.get(1).getHp());
//				Thread.sleep(200);
				
			} else if(pickdra ==2 ) {
				System.out.println(p.thunderLightening());
				myhp-=500;
				Warlock.setHp(myhp);
				System.out.println();
				Thread.sleep(200);
				System.out.println("			[나] HP>> " + Warlock.getHp());
				Thread.sleep(200);
//				System.out.println("포션을 먹었습니다.");
//				myhp = list.get(1).getHp()+200;
//				System.out.println("[나] HP>> " + list.get(1).getHp());
//				Thread.sleep(200);
				
			}
			
			System.out.println();
			System.out.println("			==========[영웅이]의 공격==========");
			System.out.println();
			System.out.println("			[1] 무기공격                   [2] 마법공격");
			int pickattack = sc.nextInt();
			Thread.sleep(200);
			
			if(pickattack==1) { //무기공격
				
				if(pickWeapon==1) {
					System.out.println(p.umbAttack());
					drahp-=100;
					Drakaina.setHp(drahp);
					Thread.sleep(200);
				} else if(pickWeapon==2) {
					System.out.println(p.gaunAttack());
					drahp-=200;
					Drakaina.setHp(drahp);
					Thread.sleep(200);
				} else if(pickWeapon==3) {
					System.out.println(p.lightAttack());
					drahp-=300;
					Drakaina.setHp(drahp);
					Thread.sleep(200);
				} else if(pickWeapon==4) {
					System.out.println(p.swordAttack());
					drahp-=250;
					Drakaina.setHp(drahp);
					Thread.sleep(200);
				}
				
				
				System.out.println();
				Thread.sleep(500);
				System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
				Thread.sleep(500);
				System.out.println();
			} else if(pickattack==2) {
				System.out.println(p.warlockAttack());
				int hp = Drakaina.getHp()-1000;
				Drakaina.setHp(hp);
				System.out.println();
				Thread.sleep(500);
				System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
				Thread.sleep(500);
				System.out.println();
				
			} if (Drakaina.getHp() <= 0) {
				System.out.println("			[영웅이]님의 승리! ");
			}
			if (Warlock.getHp() <= 0) {
				System.out.println("			[드라카이나]의 승리!");
				System.out.println("			당신은 패배했습니다.....!");
			}
		
		
		
		} }
		
		if(pickClass==3) {
			
		String[] eggmongs = new String[21];
		
		eggmongs[0] = 
				  "			           .-\"-.\r\n"
				+ "			         .'     '.\r\n"
				+ "			        /         \\\r\n"
				+ "			       :           ;\r\n"
				+ "			       |           |\r\n"
				+ "			       :           :\r\n"
				+ "			        \\         /\r\n"
				+ "			         `.     .'\r\n"
				+ "			           `~~~`";
		
		eggmongs[1] = 
				  "			           .-\"-.\r\n"
				+ "			         .'     '.\r\n"
				+ "			        /         \\\r\n"
				+ "			       :           ;\r\n"
				+ "			       |           |\r\n"
				+ "			       :      `Y   :\r\n"
				+ "			        \\       \\ /\r\n"
				+ "			         `.     .'\r\n"
				+ "			           `~~~`";
		
		eggmongs[2] = 
				  "			           .-\"-.\r\n"
				+ "			         .'     '.\r\n"
				+ "			        /         \\\r\n"
				+ "			       :        \\/ ;\r\n"
				+ "			       |    __  /  |\r\n"
				+ "			       :      `Y   :\r\n"
				+ "			        \\       \\ /\r\n"
				+ "			         `.     .'\r\n"
				+ "			           `~~~`";
		
		eggmongs[3] = 
				  "			           .-\"-.\r\n"
				+ "			         .'     '.\r\n"
				+ "			        /    _\\_  \\\r\n"
				+ "			       :        \\/ ;\r\n"
				+ "			       |   \\__  /  |\r\n"
				+ "			       :   /  `Y   :\r\n"
				+ "			        \\    .--\\ /\r\n"
				+ "			         `.     .'\r\n"
				+ "			           `~~~`";
		
		eggmongs[4] = 
				  "			           .-\"-.\r\n"
				+ "			         .'  \\/ '.\r\n"
				+ "			        /\\/  _\\_  \\\r\n"
				+ "			       : _\\     \\/ ;\r\n"
				+ "			       |   \\__  /  |\r\n"
				+ "			       :  _/  `Y-- :\r\n"
				+ "			        \\ /  .--\\ /\r\n"
				+ "			         `. /   .'\r\n"
				+ "			           `~~~`";
		
		eggmongs[5] = 
				  "			           .-\"-.\r\n"
				+ "			         .' `\\/_'.\r\n"
				+ "			        /\\/ \\_\\_  \\\r\n"
				+ "			       : _\\ /   \\/_;\r\n"
				+ "			       |/  \\__/ /  |\r\n"
				+ "			       : \\_/  `Y--':\r\n"
				+ "			        \\ / \\.--\\ /\r\n"
				+ "			         `. /   .'\r\n"
				+ "			           `~~~`";
		
		eggmongs[6] = 
				  "			           .-\"-.\r\n"
				+ "			         .' `\\/_'.\r\n"
				+ "			        /\\/ \\_\\_  \\\r\n"
				+ "			       : _\\ /   \\//\r\n"
				+ "			       |/  \\__/ / \\\r\n"
				+ "			       : \\_/  `Y--':\r\n"
				+ "			        \\ / \\.--\\ /\r\n"
				+ "			         `. /   .'  /\\\r\n"
				+ "			           `~~~` .-.`\"\r\n"
				+ "			                 `'`";
		eggmongs[7] = 
				  "			           .-\"-.\r\n"
				+ "			         .' `\\/_'.\r\n"
				+ "			        /\\/ \\_\\/\\_\\\r\n"
				+ "			       : _\\(o o)\\/\r\n"
				+ "			       |/  \\_^/\\_/\\\r\n"
				+ "			       : \\_/  `Y--':\r\n"
				+ "			        \\ / \\.--\\ /    |\\\r\n"
				+ "			         `. /   .'  /\\ `~\r\n"
				+ "			           `~~~` .-.`\"\r\n"
				+ "			                 `'`";
		eggmongs[8] = 
				  "			           .-\"-.\r\n"
				+ "			         .' `\\/_'.\r\n"
				+ "			        /\\/{\\_\\/\\/\\\r\n"
				+ "			        `  | \" | /\\\r\n"
				+ "			       //:\\(o o)//\\\\\r\n"
				+ "			       |/  \\_^/\\_/\\|\r\n"
				+ "			       : \\_/  `Y--':\r\n"
				+ "			   /^|  \\ / \\.--\\ /    |\\\r\n"
				+ "			   `\" .-.`. /   .'  /\\ `~\r\n"
				+ "			        `  `~~~` .-.`\"\r\n"
				+ "			                 `'`";
		eggmongs[9] = 
				  "			           .-\"-.\r\n"
				+ "			         .' `\\/_'.\r\n"
				+ "			        /\\/{\\_\\/\\/\\\r\n"
				+ "			        `\\ | \" | /\\\r\n"
				+ "			       //:\\(o o)//\\\\\r\n"
				+ "			       |/  \\_^/\\_/\\| \r\n"
				+ " 			      : \\_/  `Y--':\r\n"
				+ "			   /^|  \\ / \\.--\\ /    |\\\r\n"
				+ "			   `\" .-.`. /   .'  /\\ `~\r\n"
				+ "			        `  `~~~` .-.`\"\r\n"
				+ "			                 `'`";
		eggmongs[10] = 
				  "			      _(,  {\\V/}  ,)_\r\n"
				+ "			        /\\ | \" | /\\ \\/\\-'^^\\/\\/\r\n"
				+ "			       //\\\\(o o)//\\\\ '.     .'\r\n"
				+ "			       ||\\/\\_^/\\_/\\|   '-.-'\r\n"
				+ "			       : \\_/  `Y--':\r\n"
				+ "			   /^|  \\ / \\.--\\ /    |\\\r\n"
				+ "			   `\" .-.`. /   .'  /\\ `~\r\n"
				+ "			        `  `~~~` .-.`\"\r\n"
				+ "			                 `'`";
		eggmongs[11] = 
				  "			      _(,  {\\V/}  ,)_\r\n"
				+ "			        /\\ | \" | /\\\r\n"
				+ "			       //\\\\(o o)//\\\\ \\/\\-'^^\\/\\/\r\n"
				+ "			       ||\\/\\_^/\\_/\\|  '.     .'\r\n"
				+ "			       : \\_/  `Y--':    '-.-'\r\n"
				+ "			   /^|  \\ / \\.--\\ /    |\\\r\n"
				+ "			   `\" .-.`. /   .'  /\\ `~\r\n"
				+ "			        `  `~~~` .-.`\"\r\n"
				+ "			                 `'`";
		eggmongs[12] =
				  "			      _(,  {\\V/}  ,)_\r\n"
				+ "			        /\\ | \" | /\\\r\n"
				+ "			       //\\\\(o o)//\\\\ \\/\\-'^^\\/\\/\r\n"
				+ "			       ||::/ ^ \\::||  '.     .'\r\n"
				+ "			       : \\_/\\_/`Y-':    '-.-'\r\n"
				+ "			   /^|  \\ / \\.--\\ /    |\\\r\n"
				+ "			   `\" .-.`. /   .'  /\\ `~\r\n"
				+ "			        `  `~~~` .-.`\"\r\n"
				+ "			         /'.     `'`\r\n"
				+ "			         ``";
		eggmongs[13] = 
				  "			      _(,  {\\V/}  ,)_\r\n"
				+ "			        /\\ | \" | /\\\r\n"
				+ "			       //\\\\(o o)//\\\\ \\/\\-'^^\\/\\/\r\n"
				+ "			       ||::/ ^ \\::||  '.     .'\r\n"
				+ "			     : \\_/\\(   ))/`Y-':  '-.-'\r\n"
				+ "			   /^|\\ / \\\\\" \"//--\\ /  |\\\r\n"
				+ "			   `\" .`.  \\)I(<   .'/\\ `~\r\n"
				+ "			        ``~~\"`\"\" ~`-.`\"\r\n"
				+ "			         /'.      `'`\r\n"
				+ "			         ``";
		eggmongs[14] = 
				  "			      _(,  {\\V/}  ,)_\r\n"
				+ "			        /\\ | \" | /\\\r\n"
				+ "			       //\\\\(o o)//\\\\ \\/\\-'^^\\/\\/\r\n"
				+ "			       ||::/ ^ \\::||  '.     .'\r\n"
				+ "			   : \\_/\\|((   ))||/`Y-''-.-'\r\n"
				+ "			 /^|\\ / \\  \\\" \"/  /--\\ /|\\\r\n"
				+ "			 `\" .`.  \\  )I(  < .'/\\ `~\r\n"
				+ "			      ``~~ \"\"`\"\" ~`-.`\"\r\n"
				+ "			       /'.          `'`\r\n"
				+ "			       ``";
		eggmongs[15] =
				  "			      _(,  {\\V/}  ,)_\r\n"
				+ "			        /\\ | \" | /\\\r\n"
				+ "			       //\\\\(o o)//\\\\\r\n"
				+ "			       ||::/ ^ \\::||\r\n"
				+ "			       |||((   ))|||\r\n"
				+ "			       |'  \\\" \"/  '|\r\n"
				+ "			            )I( \r\n"
				+ "			           \"\"`\"\"\r\n"
				+ "			 ";
		eggmongs[16] =
				  "			                                /|\r\n"
				+ "			                                //\r\n"
				+ "			            .==.        .==.   //\r\n"
				+ "			           //`^\\\\      //^`\\\\ //\r\n"
				+ "			          // ^ ^\\(\\__/)/^ ^^\\//\r\n"
				+ "			         //^ ^^ ^/6  6\\ ^^ ^//\\\r\n"
				+ "			        //^ ^^ ^/( .. )\\^ _// \\\\\r\n"
				+ "			       // ^^ ^/\\| v\"\"v |/@@@) ^\\\\\r\n"
				+ "			      // ^^/\\/ /  `~~`   @\"/\\^ ^\\\\\r\n"
				+ "			      \\\\^ /  _/  /IIII. \\_/  \\^ //\r\n"
				+ "			       \\\\/  /(  (IIIIII/  \\   \\//\r\n"
				+ "			        ^  /  \\  \\IIII'    \\   ^\r\n"
				+ "			           \\  ((((`II'     /\r\n"
				+ "			         .--'  /\\_____/\\  `--.\r\n"
				+ "			        ((((--'         '--))))";
		eggmongs[17] = 
				  "			            .==.        .==.  /|\r\n"
				+ "			           //`^\\\\      //^`\\\\//\r\n"
				+ "			          //^^^ ^(\\__/) ^^ ^//\r\n"
				+ "				     //^ ^ ^^(6  6) ^  //\\\\\r\n"
				+ "			        //^^ ^/\\ |v\"\"v| __//^ \\\\   \r\n"
				+ "			       // ^/\\/ _/ `~~` |@\"/\\^ ^\\\\\r\n"
				+ "			      \\\\^ /   // /IIIII\\_/  \\^ //\r\n"
				+ "			       \\\\/    \\(((`II\"   /   \\//\r\n"
				+ "			        ^   .--' /\\___/\\ `--. ^\r\n"
				+ "			           (((--'       '--)))";
		eggmongs[18] = 
				  "			         _(.==.         .==.)_\r\n"
				+ "			          //`^\\\\(\\_._/)//^`\\\\\r\n"
				+ "			         //^ ^ ^( 6 6 )^ ^ ^\\\\\r\n"
				+ "			        //^ ^ ^/\\( \" )/\\^ ^ ^\\\\  \r\n"
				+ "			       // ^ /\\/_/ v\"v \\_\\/\\^  \\\\\r\n"
				+ "			       \\\\^ /  // /===\\ \\\\  \\ ^//\r\n"
				+ "			        \\\\/   \\(((===)))/   \\//\r\n"
				+ "			         ^   .-' /\\__/\\ `-.  ^\r\n"
				+ "			          (((-'      '-)))";
		eggmongs[19] = 
				  "			      _(,  {\\V/}  ,)_\r\n"
				+ "			        /\\ | \" | /\\ \\/\\-'^^\\/\\/\r\n"
				+ "			       //\\\\(o o)//\\\\ '.     .'\r\n"
				+ "			       ||\\/\\_^/\\_/\\|   '-.-'\r\n"
				+ "			       : \\_/  `Y--':\r\n"
				+ "			   /^|  \\ / \\.--\\ /    |\\\r\n"
				+ "			   `\" .-.`. /   .'  /\\ `~\r\n"
				+ "			        `  `~~~` .-.`\"\r\n"
				+ "			                 `'`";
		
		eggmongs[20] = 
				"			\\.\r\n"
				+ "			 \\\\      .\r\n"
				+ "			  \\\\ _,.+;)_\r\n"
				+ "			  .\\\\;~%:88%%.\r\n"
				+ "			 (( a   `)9,8;%.\r\n"
				+ "			 /`   _) ' `9%%%?\r\n"
				+ "			(' .-' j    '8%%'\r\n"
				+ "			 `\"+   |    .88%)+._____..,,_   ,+%$%.\r\n"
				+ "			       :.   d%9`             `-%*'\"'~%$.\r\n"
				+ "			    ___(   (%C                 `.   68%%9\r\n"
				+ "			  .\"        \\7                  ;  C8%%)`\r\n"
				+ "			  : .\"-.__,'.____________..,`   L.  \\86' ,\r\n"
				+ "			  : L    : :            `  .'\\.   '.  %$9%)\r\n"
				+ "			  ;  -.  : |             \\  \\  \"-._ `. `~\"\r\n"
				+ "			   `. !  : |              )  >     \". ?\r\n"
				+ "			     `'  : |            .' .'       : |\r\n"
				+ "			         ; !          .' .'         : |\r\n"
				+ "			        ,' ;         ' .'           ; (\r\n"
				+ "			       .  (            (            `  \\\r\n"
				+ "			       \"\"\"'          \"\"'             `\"\" ";
				
		
		
		
		for(int a = 0; a<eggmongs.length; a++) {
			System.out.println("\n\n\n\n\n\n\n\n");
			System.out.println(eggmongs[a]);
			System.out.println("\n\n\n\n\n\n\n\n");
			Thread.sleep(200);
		}
		
		Thread.sleep(1000);
		System.out.println("			어랏...? [에그몽 초콜릿]의 상태가 이상하다....  "); 
		Thread.sleep(1000);
		System.out.println("			[에그몽 초콜릿]에 금이 가기 시작했다.... ");
		Thread.sleep(1000);
		System.out.println("			에그몽이 부화했다. 유니콘이 되었습니다. ");
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c7e10 = sc.nextInt();
		if(c7e10==0) {	
		}
		
		String paladin = 
				  "			                            _____\r\n"
				+ "			             ,             /@@@@@=-\r\n"
				+ "			             \\\\            @@@@@@@@@@=-\r\n"
				+ "			             \\\\          _\\@/\\@@@@@=-\r\n"
				+ "			              \\\\        /_ +\\ \\@@@@@=-\r\n"
				+ "			        ,      \\\\      (_/   )  \\@@@@=-\r\n"
				+ "			        \\\\      \\\\     (_____)    \\@@=-\r\n"
				+ "			        _\\\\_/\\_ _\\\\__  /     \\     ~~\r\n"
				+ "			  ____,/+-  `/\\\\  { \\_|___(__ )\r\n"
				+ "			 >             \\\\  )_|/  ___  \\\r\n"
				+ "			 \\_/--\\___/     \\\\.` / <-q-p-> \\\r\n"
				+ "			    _//   )      \\(\\/\\ <-d-b-> /___\r\n"
				+ "			 _____  /         \\/ \\  \\|/  //   \\__\r\n"
				+ "			 /     \\/          /   \\_____//     \\_\\\r\n"
				+ "			 | /\\_  |         (_  /______\\\\     |||\r\n"
				+ "			 | \\_ | |         | \\|   <    \\\\    /||\r\n"
				+ "			 \\_\\_\\ \\/     ____\\  |____\\    \\)  / ||\r\n"
				+ "			       /    _/  <____)\\    (      / //\\\\\r\n"
				+ "			      /   _/           \\    \\    (  \\\\//\r\n"
				+ "			     (   /              )  / \\    \\  \\/\r\n"
				+ "			     /  /              /  /   \\    )\r\n"
				+ "			 ---/  /           ---/  /-----)  /-----\r\n"
				+ "			  _/__/             _/__/     /  /\r\n"
				+ "			 /__/               /__/     _/__/\r\n"
				+ "			                           /__/";
		System.out.println(paladin);
	
		Thread.sleep(1000);
		System.out.println("			유니콘에 올라탔습니다..  "); 
		Thread.sleep(1000);
		System.out.println("			당신의 직업은 이제부터 [성기사]입니다");
		Thread.sleep(1000);
		System.out.println("			크리티컬 스킬 [빛의 심판-500]을 배웠습니다.");
		System.out.println();
		System.out.println("			넘어가기 [0] ");
		int c7e11 = sc.nextInt();
		if(c7e11==0) {	
		}
		
		System.out.println("			전투가 시작되었습니다.");
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			[나] HP>> " + Paladin.getHp());
		System.out.println();
		Thread.sleep(1000);
		
		while(Drakaina.getHp()>0&&Paladin.getHp()>0) {
			
			if(pickWeapon==1) {
				Paladin.setAttack("			우산공격~!");
			} else if(pickWeapon==2) {
				Paladin.setAttack("			건틀렛주먹~!");
			} else if(pickWeapon==3) {
				Paladin.setAttack("			광선검어택~!");
			} else if(pickWeapon==4) {
				Paladin.setAttack("			해골검어택~!");
			}
			
			int myhp = Paladin.getHp();
			int drahp = Drakaina.getHp();
			System.out.println("			==========[드라카이나]의 공격==========");
			System.out.println();
			System.out.println("			[1] 일반공격                   [2] 크리티컬 ");
			int pickdra = sc.nextInt();
			Thread.sleep(200);
			if(pickdra == 1) {
				System.out.println(p.fireRage());
				myhp-=300;
				Paladin.setHp(myhp);
				System.out.println();
				Thread.sleep(200);
				System.out.println("			[나] HP>> " + Paladin.getHp());
				Thread.sleep(200);
//				System.out.println("포션을 먹었습니다.");
//				myhp = list.get(1).getHp()+200;
//				System.out.println("[나] HP>> " + list.get(1).getHp());
//				Thread.sleep(200);
				
			} else if(pickdra ==2 ) {
				System.out.println(p.thunderLightening());
				myhp-=500;
				Paladin.setHp(myhp);
				System.out.println();
				Thread.sleep(200);
				System.out.println("			[나] HP>> " + Paladin.getHp());
				Thread.sleep(200);
//				System.out.println("포션을 먹었습니다.");
//				myhp = list.get(1).getHp()+200;
//				System.out.println("[나] HP>> " + list.get(1).getHp());
//				Thread.sleep(200);
				
			}
			
			System.out.println();
			System.out.println("			==========[영웅이]의 공격==========");
			System.out.println();
			System.out.println("			[1] 무기공격                   [2] 마법공격");
			int pickattack = sc.nextInt();
			Thread.sleep(200);
			
			if(pickattack==1) { //무기공격
				
				if(pickWeapon==1) {
					System.out.println(p.umbAttack());
					drahp-=100;
					Drakaina.setHp(drahp);
					Thread.sleep(200);
				} else if(pickWeapon==2) {
					System.out.println(p.gaunAttack());
					drahp-=200;
					Drakaina.setHp(drahp);
					Thread.sleep(200);
				} else if(pickWeapon==3) {
					System.out.println(p.lightAttack());
					drahp-=300;
					Drakaina.setHp(drahp);
					Thread.sleep(200);
				} else if(pickWeapon==4) {
					System.out.println(p.swordAttack());
					drahp-=250;
					Drakaina.setHp(drahp);
					Thread.sleep(200);
				}
				
				
				System.out.println();
				Thread.sleep(500);
				System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
				Thread.sleep(500);
				System.out.println();
			} else if(pickattack==2) {
				System.out.println(p.paladinAttack());
				int hp = Drakaina.getHp()-1000;
				Drakaina.setHp(hp);
				System.out.println();
				Thread.sleep(500);
				System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
				Thread.sleep(500);
				System.out.println();
				
			} if (Drakaina.getHp() <= 0) {
				System.out.println("			[영웅이]님의 승리! ");
			}
			if (Paladin.getHp() <= 0) {
				System.out.println("			[드라카이나]의 승리!");
				System.out.println("			당신은 패배했습니다.....!");
			}
		
		} }
		
		if(pickClass==4) {
		String human =
				  "			⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣤⣶⠶⠶⣶⣤⣤⡀⠀⠀⠀⠀⠀⠀\r\n"
				+ "		⠀⠀⠀⠀⠀⢀⣴⠾⠛⠉⠀⢠⣾⣴⡾⠛⠻⣷⣄⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⢶⣶⣶⣿⣁⠀⠀⠀⠀⢸⣿⠏⢀⣤⣶⣌⠻⣦⡀⠀⠀⠀\r\n"
				+ "			⠀⠀⣴⡟⠁⢉⣙⣿⣦⡀⠀⢸⡏⣴⠟⢡⣶⣿⣧⡹⣷⡀⠀⠀\r\n"
				+ "			⠀⣼⠏⢀⣾⠟⠛⠛⠻⣿⡆⠀⠀⢿⣄⠀⠙⠉⠹⣷⡸⣷⠀⠀\r\n"
				+ "			⢠⣿⠀⢸⡿⢿⠇⠀⠀⣾⠇⠀⣀⣈⠻⢷⣤⣤⣤⡾⠃⢹⣇⠀\r\n"
				+ "			⢸⣿⠀⢸⣧⣀⣀⣠⣾⢋⣴⢿⣿⡛⠻⣶⣤⣉⠁⠀⠀⠀⣿⠀\r\n"
				+ "			⠈⣿⠀⠀⠙⠛⠛⠋⠁⣼⣯⣀⣿⠿⠶⠟⠉⠛⢷⣄⠀⠀⣿⡇\r\n"
				+ "			⠀⣿⠀⠀⠀⠀⠀⠀⠀⣿⡏⠉⠁⠀⠀⢀⣴⢶⣄⢻⡇⠀⢸⡇\r\n"
				+ "			⠀⢻⣇⠀⠀⠀⠀⠀⢠⡿⢀⣀⢠⣾⠷⣾⣧⡶⠿⠟⠁⠀⣾⡇\r\n"
				+ "			⠀⠈⣿⣧⡀⠀⠀⣠⣿⣷⠟⢻⣿⣷⡾⠛⠉⠀⠀⠀⠀⢀⣿⠀\r\n"
				+ "			⠀⠀⢹⣿⢻⣦⡀⠉⠛⠛⠛⠛⠋⠁⠀⠀⠀⠀⠀⠀⠀⣼⠏⠀\r\n"
				+ "			⠀⠀⠀⠛⠀⠈⠻⠷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⠟⠀⠀\r\n"
				+ "			⢰⣖⣻⢫⣭⣭⣭⠭⠭⠭⠭⠭⢭⢹⣛⣒⡢⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⣾⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⣿⢸⠸⠛⠛⠿⣷⣭⣭⣽⣿⠷⣶⣶⣶⣤⣤⣤⢄\r\n"
				+ "			⣿⣏⡀⡾⣿⣿⣿⣿⣿⣿⣿⣿⣸⡄⠀⠀⠀⣸⣿⣿⣿⣷⣿⠎⣿⣿⣿⣿⣿⣿\r\n"
				+ "			⣿⣿⣶⢡⢺⣿⣿⣿⣿⣿⣿⣿⣿⢸⣐⣒⣾⢞⣻⣿⣿⣷⠷⠿⠿⠏⠉⠛⠛⠛\r\n"
				+ "			⠸⢯⣿⣜⣒⣒⣒⣚⣛⣛⣛⣛⣛⣸⣛⣯⠵⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			";
	System.out.println(human);
	
	Thread.sleep(1000);
	System.out.println("			[영웅이] 참이슬을 마신다. "); 
	Thread.sleep(1000);
	System.out.println("			[영웅이] 알 수 없는 용기가 솟아난다. "); 
	Thread.sleep(1000);
	System.out.println("			전투게이지 상승!!");
	Thread.sleep(1000);
	System.out.println("			당신의 직업은 이제부터 [겁대가리상실한 타락 휴먼]입니다");
	Thread.sleep(1000);
	System.out.println("			크리티컬 스킬 [용감무쌍(-50)]을 배웠습니다.");
	System.out.println();
	System.out.println("			넘어가기 [0] ");
	int c7e12 = sc.nextInt();
	if(c7e12==0) {	
	}
	
	System.out.println("			전투가 시작되었습니다.");
	System.out.println();
	Thread.sleep(1000);
	System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
	System.out.println();
	Thread.sleep(1000);
	System.out.println("			[나] HP>> " + Human.getHp());
	System.out.println();
	Thread.sleep(1000);
	
	while(Drakaina.getHp()>0&&Human.getHp()>0) {
		
		if(pickWeapon==1) {
			Paladin.setAttack("			우산공격~!");
		} else if(pickWeapon==2) {
			Paladin.setAttack("			건틀렛주먹~!");
		} else if(pickWeapon==3) {
			Paladin.setAttack("			광선검어택~!");
		} else if(pickWeapon==4) {
			Paladin.setAttack("			해골검어택~!");
		}
		
		int myhp = Human.getHp();
		int drahp = Drakaina.getHp();
		System.out.println("			==========[드라카이나]의 공격==========");
		System.out.println();
		System.out.println("			[1] 일반공격                   [2] 크리티컬 ");
		int pickdra = sc.nextInt();
		Thread.sleep(200);
		if(pickdra == 1) {
			System.out.println(p.fireRage());
			myhp-=300;
			Human.setHp(myhp);
			System.out.println();
			Thread.sleep(200);
			System.out.println("			[나] HP>> " + Human.getHp());
			Thread.sleep(200);
//			System.out.println("포션을 먹었습니다.");
//			myhp = list.get(1).getHp()+200;
//			System.out.println("[나] HP>> " + list.get(1).getHp());
//			Thread.sleep(200);
			
		} else if(pickdra ==2 ) {
			System.out.println(p.thunderLightening());
			myhp-=500;
			Human.setHp(myhp);
			System.out.println();
			Thread.sleep(200);
			System.out.println("			[나] HP>> " + Human.getHp());
			Thread.sleep(200);
//			System.out.println("포션을 먹었습니다.");
//			myhp = list.get(1).getHp()+200;
//			System.out.println("[나] HP>> " + list.get(1).getHp());
//			Thread.sleep(200);
			
		}
		
		System.out.println();
		System.out.println("			==========[영웅이]의 공격==========");
		System.out.println();
		System.out.println("			[1] 무기공격                   [2] 마법공격");
		int pickattack = sc.nextInt();
		Thread.sleep(200);
		
		if(pickattack==1) { //무기공격
			
			if(pickWeapon==1) {
				System.out.println(p.umbAttack());
				drahp-=100;
				Drakaina.setHp(drahp);
				Thread.sleep(200);
			} else if(pickWeapon==2) {
				System.out.println(p.gaunAttack());
				drahp-=200;
				Drakaina.setHp(drahp);
				Thread.sleep(200);
			} else if(pickWeapon==3) {
				System.out.println(p.lightAttack());
				drahp-=300;
				Drakaina.setHp(drahp);
				Thread.sleep(200);
			} else if(pickWeapon==4) {
				System.out.println(p.swordAttack());
				drahp-=250;
				Drakaina.setHp(drahp);
				Thread.sleep(200);
			}
			
			
			System.out.println();
			Thread.sleep(500);
			System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
			Thread.sleep(500);
			System.out.println();
		} else if(pickattack==2) {
			System.out.println(p.HumanAttack());
			int hp = Drakaina.getHp()-1000;
			Drakaina.setHp(hp);
			System.out.println();
			Thread.sleep(500);
			System.out.println("			[드라카이나] HP >>" + Drakaina.getHp());
			Thread.sleep(500);
			System.out.println();
			
		} if (Drakaina.getHp() <= 0) {
			System.out.println("			[영웅이]님의 승리! ");
		}
		if (Human.getHp() <= 0) {
			System.out.println("			[드라카이나]의 승리!");
			System.out.println("			당신은 패배했습니다.....!");
		}
	
	}
		}
	
		
		
		
		///////////////////////////////////// Final chapter.8 Home sweet home. 
		
		String victory=
				  "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⠞⠋⠁⠀⠀⠀⠀⣀⣀⣀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣫⡞⠁⠀⠀⢀⣠⣶⡛⠩⢹⡿⠖⠛⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⠟⡞⠀⠀⣀⣴⣿⠟⢁⣤⣞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⠛⣿⠀⣿⣋⣉⣵⣻⣯⠴⠒⠶⣚⠓⠲⣖⠿⣿⢵⣶⣤⣤⣴⣾⠋⠀⢀⣀⣀⡤⠔⣺⠏\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⡽⣏⡤⠟⠋⠉⠀⠀⠀⠀⠀⠉⠑⠢⡀⠑⢆⠈⢧⠈⣦⠘⠆⠙⠉⡏⠫⠙⠉⠃⢸⣠⠞⠁⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠟⠁⠀⣠⣾⣉⣉⠶⠀⠀⠀⠀⠀⠀⠘⡄⢸⠀⡜⠀⠇⢠⠀⡄⢀⣃⣀⣰⠴⠟⠋⠁⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⢠⡖⠀⠀⠀⢀⣾⠃⠀⢠⣞⡡⢋⡾⠀⠀⠀⠀⠀⠀⠀⠀⣠⡧⣾⣒⠓⢾⣒⠛⠚⢛⣩⣉⣙⣦⣄⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⡰⢻⣡⣾⣴⠧⠟⣀⠄⠒⠛⠒⠚⣛⠅⠀⠀⢀⡖⠉⠁⡠⠌⠁⠀⠐⠚⠿⢶⣽⣦⡀⠀⢀⡭⠑⣢⣍⣳⣦⡀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⣴⣷⣾⠿⠙⠡⠒⠉⠀⠀⢀⠀⠀⠀⢁⡤⣀⣠⠊⠀⢠⢜⡢⣄⡀⠀⠠⢄⣙⣦⠽⠮⣿⣦⡀⢹⢯⠁⠀⠀⠙⠻⢄⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⢀⡟⢹⠃⠀⠀⠀⠀⠀⣀⡴⣿⣿⣶⡖⢿⣠⠞⠁⠠⡀⣿⠀⠉⠪⡻⣄⡀⡎⠁⠈⢣⡀⠀⠉⠛⢦⣌⣦⡀⠀⠀⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠘⣧⠀⣀⣀⣀⣀⣴⣾⣙⣾⣿⣿⣿⡿⠊⠀⠀⠀⠀⣷⢃⣄⢀⠀⠙⢌⢿⢧⢡⠀⠀⠱⡄⠀⠀⠀⠹⣿⢽⣦⣄⠀⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠈⠹⣿⣮⣾⣯⣷⣿⡟⣿⣿⣿⠋⠀⠀⠀⠀⠀⢰⣷⣿⢿⢿⡀⠀⡎⢎⢧⣯⡇⠀⠀⠹⡀⠀⠀⢤⠘⢷⢻⠻⣦⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⢀⣠⣤⣤⣌⣙⣿⣿⢛⣻⣿⣿⠟⠁⠀⠀⠀⢀⡤⠚⠉⠀⠈⢣⡀⡿⠿⢿⡈⢿⣿⠀⠀⠀⠀⢳⡀⠀⠈⠁⠈⣯⣇⠈⠂⠀⠀\r\n"
				+ "			⠀⠀⡴⢋⠔⠋⠉⠙⢿⣃⣉⣽⣿⡾⠋⠀⠀⠀⣠⢞⣁⠤⠤⢴⣶⡶⣀⠹⠃⠀⠀⠑⢾⣿⠀⠀⠀⠀⠀⢧⠀⠀⠀⠀⠸⣿⠀⠀⠀⠀\r\n"
				+ "			⠀⣞⣡⠃⠀⠀⠀⠀⠀⠀⠹⡟⠉⠀⣤⠴⣤⣿⠛⠉⠀⠀⠀⠈⢯⣿⣦⡀⠑⠦⣀⠀⠘⡇⢠⠀⠀⠀⠀⠘⡄⠀⠀⠀⠀⢻⡄⠀⠀⠀\r\n"
				+ "			⡸⢸⣱⣀⣀⠀⠀⠀⠀⠀⠀⠈⠓⠦⠼⠷⠞⠛⠁⠀⠀⠀⠀⠀⠸⠇⠀⠻⣄⠀⠀⠷⡈⠀⢰⠀⠀⠀⠀⠀⢳⠀⠀⠀⠀⠘⡇⠀⠀⠀\r\n"
				+ "			⡇⠸⣌⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣦⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠈⡆⠀⠀⠀⠀⣧⠀⠀⠀\r\n"
				+ "			⠘⠒⠘⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣯⣇⠳⡀⠀⠀⠠⠀⠀⠀⠀⠀⠀⢇⠀⠀⠀⠀⢸⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠚⠋⠙⢳⡖⣿⠀⠘⢆⠀⠀⢇⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⢸⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⣾⡾⢹⡀⠀⠈⢆⠀⠘⢆⠀⠀⠀⠀⢸⠀⠀⠀⠀⡼⠀⠀⠀\r\n"
				+ "			⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢉⣿⡴⠋⠀⢸⠁⠀⠀⠈⣆⠀⠘⡆⠀⠀⠀⠸⠀⠀⠀⢀⡇⠀⠀⠀\r\n";
		
		System.out.println("\n\n\n\n");
		System.out.println(victory);
		System.out.println("\n\n\n\n");
		Thread.sleep(1000);
		System.out.println("			[드라카이나]가 피를 토하며 쓰러졌습니다...! "); 
		Thread.sleep(1000);
		System.out.println("			[영웅이]의 승리!!!!!!!!! "); // 괄호 안에 ""넣는법
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			[영웅이] 드디어 집에 갈 수 있겠다 ㅠㅠ!! "); // 괄호 안에 ""넣는법
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			넘어가기 [0] ");
		int c8e1 = sc.nextInt();
		if(c8e1==0) {	
		}
		
		System.out.println("\n\n\n\n");
		System.out.println(mother);
		System.out.println("\n\n\n\n");
		Thread.sleep(1000);
		System.out.println("			[엄마] 영웅이 왔니~? 많이 늦었네 ~"); 
		Thread.sleep(1000);
		System.out.println("			[영웅이] 그게.... 친구를 좀 만나서... "); // 괄호 안에 ""넣는법
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			넘어가기 [0] ");
		int c8e2 = sc.nextInt();
		if(c8e2==0) {	
		}
		
		String dinner =
				  "			               (\r\n"
				+ "			            )    )\r\n"
				+ "			         _.(--\"(\"\"\"--.._\r\n"
				+ "			        /, _..-----).._,\\\r\n"
				+ "			       |  `'''-----'''`  |\r\n"
				+ "			        \\               /\r\n"
				+ "			         '.           .'\r\n"
				+ "			           '--.....--'\r\n"
				+ "												\r\n"
				+ "		           ___           .-\"\"-.\r\n"
				+ "		         /   '''---...-'.'  `\\\\\r\n"
				+ "		         \\___...---\"\"\"-._-.__//\r\n"
				+ "		                         '---'";
		System.out.println("\n\n\n\n");
		System.out.println(dinner);
		System.out.println("\n\n\n\n");
		Thread.sleep(1000);
		System.out.println("			맛있는 두부 김치찌개 완성 (보글보글)"); 
		Thread.sleep(1000);
		System.out.println("			[엄마] 저녁 먹자!!"); 
		Thread.sleep(1000);
		System.out.println("			[영웅이] 잘 먹겠습니다~! "); 
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			넘어가기 [0] ");
		int c8e3= sc.nextInt();
		if(c8e3==0) {	
		}
		
		String tea1 ="			            .------.____\r\n"
				+ "			         .-'       \\ ___)\r\n"
				+ "			      .-'         \\\\\\\r\n"
				+ "			   .-'        ___  \\\\)\r\n"
				+ "			.-'          /  (\\  |)\r\n"
				+ "			         __  \\  ( | |\r\n"
				+ "			        /  \\  \\__'| |\r\n"
				+ "			       /    \\____).-'\r\n"
				+ "			     .'       /   |\r\n"
				+ "			    /     .  /    |\r\n"
				+ "			  .'     / \\/     |\r\n"
				+ "			 /      /   \\     |\r\n"
				+ "			       /    /    _|_\r\n"
				+ "			       \\   /    /\\ /\\\r\n"
				+ "			        \\ /    /__v__\\\r\n"
				+ "			         '    |       |\r\n"
				+ "			              |     .#|\r\n"
				+ "			              |#.  .##|\r\n"
				+ "			              |#######|\r\n"
				+ "			              |#######|";
		System.out.println("\n\n");
		System.out.println(tea1);
		System.out.println("\n\n");
		Thread.sleep(1000);
		System.out.println("			저녁 식사가 끝나고..... "); 
		Thread.sleep(1000);
		System.out.println("			잠 자리에 들기 전에 티타임.....  "); 
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			넘어가기 [0] ");
		int c8e4 = sc.nextInt();
		if(c8e4==0) {	
		}
		
		String tea2 =
				  "			                      (\r\n"
				+ "			                        )     (\r\n"
				+ "			                 ___...(-------)-....___\r\n"
				+ "			             .-\"\"       )    (          \"\"-.\r\n"
				+ "			       .-'``'|-._             )         _.-|\r\n"
				+ "			      /  .--.|   `\"\"---...........---\"\"`   |\r\n"
				+ "			     /  /    |                             |\r\n"
				+ "			     |  |    |                             |\r\n"
				+ "			      \\  \\   |                             |\r\n"
				+ "			       `\\ `\\ |                             |\r\n"
				+ "			         `\\ `|                             |\r\n"
				+ "			         _/ /\\                             /\r\n"
				+ "			        (__/  \\                           /\r\n"
				+ "			     _..---\"\"` \\                         /`\"\"---.._\r\n"
				+ "			  .-'           \\                       /          '-.\r\n"
				+ "			 :               `-.__             __.-'              :\r\n"
				+ "			 :                  ) \"\"---...---\"\" (                 :\r\n"
				+ "			  '._               `\"--...___...--\"`              _.'\r\n"
				+ "			    \\\"\"--..__                              __..--\"\"/\r\n"
				+ "			     '._     \"\"\"----.....______.....----\"\"\"     _.'\r\n"
				+ "			        `\"\"--..,,_____            _____,,..--\"\"`\r\n"
				+ "			                      `\"\"\"----\"\"\"`\r\n";
		System.out.println("\n\n");
		System.out.println(tea1);
		System.out.println("\n\n");
		Thread.sleep(1000);
		System.out.println("			[영웅이] 내가 생각해도 난 역시 너무 대단해~ 나 진짜 이름값 한다~~!!! (자아도취!!) "); 
		Thread.sleep(1000);
		System.out.println("			[영웅이] 용까지 무찌르고 세상을 구한 나.... 나는 최고의 HERO!!! "); 
		System.out.println();
		Thread.sleep(1000);
		System.out.println("			넘어가기 [0] ");
		int c8e5 = sc.nextInt();
		if(c8e5==0) {	
		}


		mp3.play(comPath + "closing.mp3");
		System.out.println();
		System.out.println();
		System.out.println();

		Thread.sleep(100);
		System.out.println();

		for (int i = 0; i < MomAscii.getInstance().getGameEndAsciiArt().length; i++) {
			System.out.printf("\n\n\n\n\n\n\n\n\n\n\n%s\n\n\n\n\n\n\n\n\n\n\n",
					MomAscii.getInstance().getGameEndAsciiArt()[i]);
			Thread.sleep(500);
		}
		
		
		
		
		
		// 마지막에 엔딩 크레딧
		// GAME END
		// 그리고 사용된 음악 목록 올라가기
		
		
		
		} catch (Exception e) {
			e.printStackTrace();
		} 

	

		} 
		}
